["AN: Special fangz (get it, coz Im goffik) 2 my gf (ew not in that way) raven, bloodytearz666 4 helpin me wif da story and spelling. U rok! Justin ur da luv of my deprzzing life u rok 2! MCR ROX!\n", "Hi my name is Ebony Dark’ness Dementia Raven Way and I have long ebony black hair (that’s how I got my name) with purple streaks and red tips that reaches my mid-back and icy blue eyes like limpid tears and a lot of people tell me I look like Amy Lee (AN: if u don’t know who she is get da hell out of here!). I’m not related to Gerard Way but I wish I was because he’s a major fucking hottie. I’m a vampire but my teeth are straight and white. I have pale white skin. I’m also a witch, and I go to a magic school called Hogwarts in England where I’m in the seventh year (I’m seventeen). I’m a goth (in case you couldn’t tell) and I wear mostly black. I love Hot Topic and I buy all my clothes from there. For example today I was wearing a black corset with matching lace around it and a black leather miniskirt, pink fishnets and black combat boots. I was wearing black lipstick, white foundation, black eyeliner and red eye shadow. I was walking outside Hogwarts. It was snowing and raining so there was no sun, which I was very happy about. A lot of preps stared at me. I put up my middle finger at them.\n", "“Hey Ebony!” shouted a voice. I looked up. It was…. Draco Malfoy!\n", "“What’s up Draco?” I asked.\n", "“Nothing.” he said shyly.\n", "But then, I heard my friends call me and I had to go away.\n", "AN: IS it good? PLZ tell me fangz!\n", "AN: Fangz 2 bloodytearz666 4 helpin me wif da chapta! BTW preps stop flaming ma story ok!\n", "The next day I woke up in my bedroom. It was snowing and raining again. I opened the door of my coffin and drank some blood from a bottle I had. My coffin was black ebony and inside it was hot pink velvet with black lace on the ends. I got out of my coffin and took of my giant MCR t-shirt which I used for pajamas. Instead, I put on a black leather dress, a pentagram necklace, combat boots and black fishnets on. I put on four pairs of earrings in my pierced ears, and put my hair in a kind of messy bun.\n", "My friend, Willow (AN: Raven dis is u!) woke up then and grinned at me. She flipped her long waist-length raven black hair with pink streaks and opened her forest-green eyes. She put on her Marilyn Manson t-shirt with a black mini, fishnets and pointy high-heeled boots. We put on our makeup (black lipstick white foundation and black eyeliner.)\n", "“OMFG, I saw you talking to Draco Malfoy yesterday!” she said excitedly.\n", "“Yeah? So?” I said, blushing.\n", "“Do you like Draco?” she asked as we went out of the Slytherin common room and into the Great Hall.\n", "“No I so fucking don’t!” I shouted.\n", "“Yeah right!” she exclaimed. Just then, Draco walked up to me.\n", "“Hi.” he said.\n", "“Hi.” I replied flirtily.\n", "“Guess what.” he said.\n", "“What?” I asked.\n", "“Well, Good Charlotte are having a concert in Hogsmeade.” he told me.\n", "“Oh. My. Fucking. God!” I screamed. I love GC. They are my favorite band, besides MCR.\n", "“Well…. do you want to go with me?” he asked.\n", "I gasped.\n", "AN: STOP FLAMMING DA STORY PREPZ OK! odderwize fangs 2 da goffik ppl 4 da good reveiws! FANGS AGEN RAVEN! oh yeah, BTW I don’t own dis or da lyrics 4 Good Chralotte.\n", "On the night of the concert I put on my black lace-up boots with high heels. Underneath them were ripped red fishnets. Then I put on a black leather minidress with all this corset stuff on the back and front. I put on matching fishnet on my arms. I straightened my hair and made it look all spiky. I felt a little depressed then, so I slit one of my wrists. I read a depressing book while I waited for it to stop bleeding and I listened to some GC. I painted my nails black and put on TONS of black eyeliner. Then I put on some black lipstick. I didn’t put on foundation because I was pale anyway. I drank some human blood so I was ready to go to the concert.\n", "I went outside. Draco was waiting there in front of his flying car. He was wearing a Simple Plan t-shirt (they would play at the show too), baggy black skater pants, black nail polish and a little eyeliner (AN: A lot fo kewl boiz wer it ok!).\n", "“Hi Draco!” I said in a depressed voice.\n", "“Hi Ebony.” he said back. We walked into his flying black Mercedes-Benz (the license plate said 666) and flew to the place with the concert. On the way we listened excitedly to Good Charlotte and Marilyn Manson. We both smoked cigarettes and drugs. When we got there, we both hopped out of the car. We went to the mosh pit at the front of the stage and jumped up and down as we listened to Good Charlotte.\n", "“You come in cold, you're covered in blood\n", "They're all so happy you've arrived\n", "The doctor cuts your cord, hands you to your mom\n", "She sets you free into this life.” sang Joel (I don’t own da lyrics 2 dat song).\n", "“Joel is so fucking hot.” I said to Draco, pointing to him as he sung, filling the club with his amazing voice.\n", "Suddenly Draco looked sad.\n", "“What’s wrong?” I asked as we moshed to the music. Then I caught on.\n", "“Hey, it’s ok I don’t like him better than YOU!” I said.\n", "“Really?” asked Draco sensitively and he put his arm around me all protective.\n", "“Really.” I said. “Besides I don’t even know Joel and he’s going out with Hilary fucking Duff. I fucking hate that little bitch.” I said disgustedly, thinking of her ugly blonde face.\n", "The night went on really well, and I had a great time. So did Draco. After the concert, we drank some beer and asked Benji and Joel for their autographs and photos with them. We got GC concert tees. Draco and I crawled back into the Mercedes-Benz, but Draco didn’t go back into Hogwarts, instead he drove the car into……………………… the Forbidden Forest!\n", "AN: I sed stup flaming ok ebony’s name is ENOBY nut mary su OK! DRACO IS SOO IN LUV wif her dat he is acting defrent! dey nu eechodder b4 ok!\n", "“DRACO!” I shouted. “What the fuck do you think you are doing?”\n", "Draco didn’t answer but he stopped the flying car and he walked out of it. I walked out of it too, curiously.\n", "“What the fucking hell?” I asked angrily.\n", "“Ebony?” he asked.\n", "“What?” I snapped.\n", "Draco leaned in extra-close and I looked into his gothic red eyes (he was wearing color contacts) which revealed so much depressing sorrow and evilness and then suddenly I didn’t feel mad anymore.\n", "And then…………… suddenly just as I Draco kissed me passionately. Draco climbed on top of me and we started to make out keenly against a tree. He took of my top and I took of his clothes. I even took of my bra. Then he put his thingie into my you-know-what and we did it for the first time.\n", "“Oh! Oh! Oh! ” I screamed. I was beginning to get an orgasm. We started to kiss everywhere and my pale body became all warm. And then….\n", "“WHAT THE HELL ARE YOU DOING YOU MOTHERFUKERS!”\n", "It was…………………………………………………….Dumbledore!\n", "AN: STOP flaming! if u flam it menz ur a prep or a posr! Da only reson Dumbledeor swor is coz he had a hedache ok an on tup of dat he wuz mad at dem 4 having sexx! PS im nut updating umtil I get five good revoiws!\n", "Dumbledore made and Draco and I follow him. He kept shouting at us angrily.\n", "“You ludacris fools!” he shouted.\n", "I started to cry tears of blood down my pallid face. Draco comforted me. When we went back to the castle Dumbledore took us to Professor Snape and Professor McGonagall who were both looking very angry.\n", "“They were having sexual intercourse in the Forbidden Forest!” he yelled in a furious voice.\n", "“Why did you do such a thing, you mediocre dunces?” asked Professor McGonagall.\n", "“How dare you?” demanded Professor Snape.\n", "And then Draco shrieked. “BECAUSE I LOVE HER!”\n", "Everyone was quiet. Dumbledore and Professor McGonagall still looked mad but Professor Snape said. “Fine. Very well. You may go up to your rooms.”\n", "Draco and I went upstairs while the teachers glared at us.\n", "“Are you okay, Ebony?” Draco asked me gently.\n", "“Yeah I guess.” I lied. I went to the girl’s dorm and brushed my teeth and my hair and changed into a low-cut black floor-length dress with red lace all around it and black high heels. When I came out….\n", "Draco was standing in front of the bathroom, and he started to sing ‘I just wanna live’ by Good Charlotte. I was so flattered, even though he wasn’t supposed to be there. We hugged and kissed. After that, we said goodnight and he reluctantly went back into his room.\n", "AN: shjt up prepz ok! PS I wnot update ubtil u give me goood revows!\n", "The next day I woke up in my coffin. I put on a black miniskirt that was all ripped around the end and a matching top with red skulls all over it and high heeled boots that were black. I put on two pairs of skull earrings, and two crosses in my ears. I spray-painted my hair with purple.\n", "In the Great Hall, I ate some Count Chocula cereal with blood instead of milk, and a glass of red blood. Suddenly someone bumped into me. All the blood spilled over my top.\n", "“Bastard!” I shouted angrily. I regretted saying it when I looked up cause I was looking into the pale white face of a gothic boy with spiky black hair with red streaks in it. He was wearing so much eyeliner that I was going down his face and he was wearing black lipstick. He didn’t have glasses anymore and now he was wearing red contact lenses just like Draco’s and there was no scar on his forhead anymore. He had a manly stubble on his chin. He had a sexy English accent. He looked exactly like Joel Madden. He was so sexy that my body went all hot when I saw him kind of like an erection only I’m a girl so I didn’t get one you sicko.\n", "“I’m so sorry.” he said in a shy voice.\n", "“That’s all right. What’s your name?” I questioned.\n", "“My name’s Harry Potter, although most people call me Vampire these days.” he grumbled.\n", "“Why?” I exclaimed.\n", "“Because I love the taste of human blood.” he giggled.\n", "“Well, I am a vampire.” I confessed.\n", "“Really?” he whimpered.\n", "“Yeah.” I roared.\n", "We sat down to talk for a while. Then Draco came up behind me and told me he had a surprise for me so I went away with him.\n", "Draco and I held our pale white hands with black nail polish as we went upstairs. I was wearing red Satanist sings on my nails in red nail polish (AN: c doez dat sound lik a Maru Sue 2 u?). I waved to Vampire. Dark misery was in his depressed eyes. I guess he was jealous of me that I was going out with Draco. Anyway, I went upstairs excitedly with Draco. We went into his room and locked the door. Then…………\n", "We started frenching passively and we took off each others clothes enthusiastically. He felt me up before I took of my top. Then I took off my black leather bra and he took off his pants. We went on the bed and started making out naked and then he put his boy’s thingy in mine and we HAD SEX. (c is dat stupid?)\n", "“Oh Draco, Draco!” I screamed while getting an orgasm when all of a sudden I saw a tattoo I had never seen before on Draco’s arm. It was a black heart with an arrow through it. On it in bloody gothic writing were the words………… Vampire!\n", "I was so angry.\n", "“You bastard!” I shouted angrily, jumping out of the bed.\n", "“No! No! But you don’t understand!” Draco pleaded. But I knew too much.\n", "“No, you fucking idiot!” I shouted. “You probably have AIDs anyway!”\n", "I put on my clothes all huffily and then stomped out. Draco ran out even though he was naked. He had a really big you-know-what but I was too mad to care. I stomped out and did so until I was in Vampire’s classroom where he was having a lesson with Professor Snape and some other people.\n", "“VAMPIRE POTTER, YOU MOTHERFUCKER!” I yelled.\n", "AN: stop flassing ok! if u do den u r a prep!\n", "Everyone in the class stared at me and then Draco came into the room even though he was naked and started begging me to take him back.\n", "“Ebony, it’s not what you think!” Draco screamed sadly.\n", "My friend B’loody Mary Smith smiled at me understatedly. She flipped her long waste-length gothic black hair and opened her crimson eyes like blood that she was wearing contact lenses on. She had pale white skin that she was wearing white makeup on. Hermione was kidnapped when she was born. Her real parents are vampires and one of them is a witch but Voldemort killed her mother and her father committed suicide because he was depressed about it. She still has nightmares about it and she is very haunted and depressed. It also turns out her real last name is Smith and not Granger. (Since she has converted to Satanism she is in Slytherin now not Griffindoor. )\n", "“What is it that you desire, you ridiculous dimwit!” Snape demeaned angrily in his cold voice but I ignored him.\n", "“Vampire, I can’t believe you cheated on me with Draco!” I shouted at him.\n", "Everyone gasped.\n", "I don’t know why Ebony was so mad at me. I had went out with Vampire (I’m bi and so is Ebony) for a while but then he broke my heart. He dumped me because he liked Britney, a stupid preppy fucker. We were just good friends now. He had gone through horrible problems, and now he was gothic. (Haha, like I would hang out with a prep.)\n", "“But I’m not going out with Draco anymore!” said Vampire.\n", "“Yeah fucking right! Fuck off, you bastard!” I screamed. I ran out of the room and into the Forbidden Forest where I had lost my virility to Draco and then I started to bust into tears.\n", "AN: stop flaming ok! I dntn red all da boox! dis is frum da movie ok so itz nut my folt if dumbeldor swers! besuizds I SED HE HAD A HEDACHE! and da reson snap dosent lik harry now is coz hes christian and vampire is a satanist! MCR ROX!\n", "I was so mad and sad. I couldn’t believe Draco for cheating on me. I began to cry against the tree where I did it with Draco.\n", "Then all of a suddenly, an horrible man with red eyes and no nose and everything started flying towards me on a broomstick! He didn’t have a nose (basically like Voldemort in the movie) and he was wearing all black but it was obvious he wasn’t gothic. It was…… Voldemort!\n", "“No!” I shouted in a scared voice but then Voldemort shouted “Imperius!” and I couldn’t run away.\n", "“Crookshanks!” I shouted at him. Voldemort fell of his broom and started to scream. I felt bad for him even though I’m a sadist so I stopped.\n", "“Ebony.” he yelled. “Thou must kill Vampire Potter!”\n", "I thought about Vampire and his sexah eyes and his gothic black hair and how his face looks just like Joel Madden. I remembered that Draco had said I didn’t understand, so I thought, what if Draco went out with Vampire before I went out with him and they broke up?\n", "“No, Voldemort!” I shouted back.\n", "Voldemort gave me a gun. “No! Please!” I begged.\n", "“Thou must!” he yelled. “If thou does not, then I shall kill thy beloved Draco!”\n", "“How did you know?” I asked in a surprised way.\n", "Voldemort got a dude-ur-so-retarded look on his face. “I hath telekinesis.” he answered cruelly. “And if you doth not kill Vampire, then thou know what will happen to Draco!” he shouted. Then he flew away angrily on his broomstick.\n", "I was so scared and mad I didn’t know what to do. Suddenly Draco came into the woods.\n", "“Draco!” I said. “Hi!”\n", "“Hi.” he said back but his face was all sad. He was wearing white foundation and messy eyeliner kind of like a pentagram (geddit) between Joel Madden and Gerard Way.\n", "“Are you okay?” I asked.\n", "“No.” he answered.\n", "“I’m sorry I got all mad at you but I thought you cheated on me.” I expelled.\n", "“That’s okay.” he said all depressed and we went back into Hogwarts together making out.\n", "AN: stup it u gay fags if u donot lik ma story den fukk off! ps it turnz out b’loody mary isn’t a muggle afert al n she n vampire r evil datz y dey movd houses ok!\n", "I was really scared about Vlodemort all day. I was even upset went to rehearsals with my gothic metal band Bloody Gothic Rose 666. I am the lead singer of it and I play guitar. People say that we sound like a cross between GC, Slipknot and MCR. The other people in the band are B’loody Mary, Vampire, Draco, Ron (although we call him Diabolo now. He has black hair now with blue streaks in it.) and Hargrid. Only today Draco and Vampire were depressed so they weren’t coming and we wrote songs instead. I knew Draco was probably slitting his wrists (he wouldn’t die because he was a vampire too and the only way you can kill a vampire is with a c-r-o-s-s (there’s no way I’m writing that) or a steak) and Vampire was probably watching a depressing movie like The Corpse Bride. I put on a black leather shirt that showed off my boobs and tiny matching miniskirt that said Simple Plan on the butt. You might think I’m a slut but I’m really not.\n", "We were singing a cover of ‘Helena’ and at the end of the song I suddenly bust into tears.\n", "“Ebony! Are you OK?” B’loody Mary asked in a concerted voice.\n", "“What the fuck do you think?” I asked angrily. And then I said. “Well, Voldemort came and the fucking bastard told me to fucking kill Harry! But I don’t want to kill him, because, he’s really nice, even if he did go out with Draco. But if I don’t kill Harry, then Voldemort, will fucking kill Draco!” I burst into tears.\n", "Suddenly Draco jumped out from behind a wall.\n", "“Why didn’t you fucking tell me!” he shouted. “How could you- you- you fucking poser muggle bitch!” (c is dat out of character?)\n", "I started to cry and cry. Draco started to cry too all sensitive. Then he ran out crying.\n", "We practiced for one more hour. Then suddenly Dumbeldore walked in angrily! His eyes were all fiery and I knew this time it wasn’t cause he had a headache.\n", "“What have you done!” He started to cry wisely. (c dats basically nut swering and dis time he wuz relly upset n u wil c y) “Ebony Draco has been found in his room. He committed suicide by slitting his wrists.”\n", "AN: i sed stup flaming up prepz! c if dis chaptr is srupid!1111 it delz wit rly sris issus! sp c 4 urself if itz ztupid brw fangz 2 ma frend raven 4 hleping me!\n", "“NO!” I screamed. I was horrorfied! B’loody Mary tried to comfort me but I told her fuck off and I ran to my room crying myself. Dumbledore chased after me shouting but he had to stop when I went into my room cause he would look like a perv that way.\n", "Anyway, I started crying tears of blood and then I slit both of my wrists. They got all over my clothes so I took them off and jumped into the bath angrily while I put on a Linkin Park song at full volume. I grabbed a steak and almost stuck it into my heart to commit suicide. I was so fucking depressed! I got out of the bathtub and put on a black low-cut dress with lace all over it sandly. I put on black high heels with pink metal stuff on the ends and six pairs of skull earrings. I couldn’t fucking believe it. Then I looked out the window and screamed… Snap was spying on me and he was taking a video tape of me! And Loopin was masticating to it! They were sitting on their broomsticks.\n", "“EW, YOU FUCKING PERVS, STOP LOOKING AT ME NAKED! ARE YOU PEDOS OR WHAT!” I screamed putting on a black towel with a picture of Marilyn Mason on it. Suddenly Vampire ran in.\n", "“Abra Kedavra!” he yelled at Snape and Loopin pointing his womb. I took my gun and shot Snape and Loopin a gazillion times and they both started screaming and the camera broke. Suddenly, Dumblydore ran in. “Ebony, it has been revealed that someone has - NOOOOOOOOOOOOO!” he shouted looking at Snape and Loopin and then he waved his wand and suddenly…\n", "Hargrid ran outside on his broom and said everyone we need to talk.\n", "“What do you know, Hargrid? You’re just a little Hogwarts student!”\n", "“I MAY BE A HOGWARTS STUDENT….” Hargirid paused angrily. “BUT I AM ALSO A SATANIST!”\n", "“This cannot be.” Snap said in a crisp voice as blood dripped from his hand where Dumblydore’s wand had shot him. “There must be other factors.”\n", "“YOU DON’T HAVE ANY!” I yelled in madly.\n", "Loopin held up the camera triumelephantly. “The lens may be ruined but the tape is still there!”\n", "I felt faint, more than I normally do like how it feels when you do not drink enough blood.\n", "“Why are you doing this?” Loopin said angrily while he rubbed his dirty hands on his clook.\n", "And then I heard the words that I had heard before but not from him. I did not know whether to feel shocked and happy or to bite him and drink his blood because I felt faint.\n", "“BECAUSE…BECAUSE….” Hargid said and he paused in the air dramitaclly, waving his wand in the air. Then swooped he in singing to the tune of a gothic version of a song by 50 Cent.\n", "“Because you’re goffic?” Snap asked in a little afraid voice cause he was afraind it meant he was connected with Satan.\n", "“Because I LOVE HER!”\n", "AN: stop f,aing ok hargrid is a pedo 2 a lot of ppl in amerikan skoolz r lik dat I wunted 2 adres da ishu! how du u no snap iant kristian plus hargrid isn’t really in luv wif ebony dat was sedric ok!\n", "I was about to slit my wrists again with the silver knife that Drago had given me in case anything happened to him. He had told me to use it valiantly against an enemy but I knew that we must both go together.\n", "“NO!” I THOUGHT IT WAS HAIRgrid but it was Vampire. He started to scream. “OMFG! NOOOOO! MY SCAR HURTS!” and then….. his eyes rolled up! You could only see his red whites.\n", "I stopped. “How did u know?”\n", "“I saw it! And my scar turned back into the lightning bolt!”\n", "“NO!” I ran up closer. “I thought you didn’t have a scar anymore!” I shouted.\n", "“I do but Diabolo changed it into a pentagram for me and I always cover it up with foundation.” he said back. “Anyway my scar hurt and it turned back into the lightning bolt! Save me! then I had a vision of what was happening to Draco…………….Volfemort has him bondage!”\n", "Anyway I was in the school nurse’s office now recovering from my slit wrists. Snap and Loopin and HAHRID were there too. They were going to St. Mango’s after they recovered cause they were pedofiles and you can’t have those fucking pervs teaching in a school with lots of hot gurlz. Dumbledore had constipated the cideo camera they took of me naked. I put up my middle finger at them.\n", "Anyway Hargrid came into my hospital bed holding a bouquet of pink roses.\n", "“Enoby I need to tell u somethnig.” he said in a v. serious voice, giving me the roses.\n", "“Fuck off.” I told him. “You know I fucking hate the color pink anyway, and I don’t like fucked up preps like you.” I snapped. Hargrid had been mean to me before for being gottik.\n", "“No Enoby.” Hargrid says. “Those are not roses.”\n", "“What, are they goffs too you poser prep?” I asked cause I was angry that he had brought me pink roses.\n", "“I saved your life!” He yelled angrily. “No you didn’t I replied.” “You saved me from getting a Paris Hilton p- video made from your shower scene and being vued by Snap and Loopin.” Who MASTABATED (c is dat speld rong) to it he added silently.\n", "“Whatever!” I yelled angirly.\n", "He pointed his wand at the pink roses. “These aren’t roses.” He suddenly looked at them with an evil look in his eye and muttered Well If you wanted Honesty that’s all you haD TO SAY! .\n", "“That’s not a spell that’s an MCR song.” I corrected him wisely.\n", "“I know, I was just warming up my vocal cordes.” Then he screamed. “Petulus merengo mi kremicli romacio(4 all u cool goffic mcr fans out, there, that is a tribute! specially for raven I love you girl!)imo noto okayo!”\n", "And then the roses turned into a huge black flame floating in the middle of the air. And it was black. Now I knew he wasn’t a prep.\n", "“OK I believe you now wtf is Drako?”\n", "Hairgrid rolled his eyes. I looked into the balls of flame but I could c nothing.\n", "“U c, Enobby,” Dumblydore said, watching the two of us watching the flame. “2 c wht iz n da flmes(HAHA U REVIEWRS FLAMES GEDDIT) u mst find urslf 1st, k?”\n", "“I HAVE FOUND MYSELF OK YOU MEAN OLD MAN!” Hargrid yelled. dUMBLydore lookd shockd. I guess he didn’t have a headache or else he would have said something back.\n", "Hairgrid stormed off back into his bed. “U r a liar, prof dumbledoree!”\n", "Anyway when I got better I went upstairs and put on a black leather minidress that was all ripped on the ends with lace on it. There was some corset stuff on the front. Then I put on black fishnets and black high-heeled boots with pictures of Billie Joe Armstrong on them. I put my hair all out around me so I looked like Samara from the Ring (if u don’t know who she iz ur a prep so fuk off!) and I put on blood-red lipstick, black eyeliner and black lip gloss.\n", "“You look kawai, girl.” B’loody Mary said sadly. “Fangs (geddit) you do too.” I said sadly too, but I was still upset. I slit both of my wrists feeling totally depressed and I sucked all the blood. I cried again in my bathroom and put the shades on so Snap and Loopin couldn’t spy on me this time. I went to some classes. Vampire was in the Hair of Magical Magic Creatures. He looked all depressed because Draco had disappeared and he had used to be in love with Draco. He was sucking some blood from a Hufflepuff.\n", "“Hi.” he said in a depressed way. “Hi back.” I said in an wqually said way.\n", "We both looked at each other for some time. Harry had beautiful red gothic eyes so much like Dracos. Then……… we jumped on each other and started screwing each other.\n", "“STOP IT NOW YOU HORNY SIMPLETONS!” shouted Professor McGoggle who was watching us and so was everyone else.\n", "“Vampire you fucker!” I said slapping him. “Stop trying to screw me. You know I loved Draco!” I shouted and then I ran away angrily.\n", "Just then he started to scream. “OMFG! NOOOOO! MY SCAR HURTS!” and then….. his eyes rolled up! You could only see his red whites.\n", "“NO!” I ran up closer.\n", "“I thought you didn’t have a scar anymore!” I shouted.\n", "“I do but Diabolo changed it into a pentagram for me and I always cover it up with foundation.” he said back. “Anyway my scar hurt and then I had a vision of what was happening to Draco…………….Volfemort has him bondage!”\n", "SPECIAL FANGZ 2 RAVEN MY GOFFIX BLOOD SISTA WTF UR SUPPOZD 2 RIT DIS!11111111\n", "HEY RAVEN DO U KNOW WHERE MY SWEATER I\n", "AN: raven fangz 4 gelpin me agen im sory ah tok ur postr of gerard but dat guy is such a fokin sexbom! PREPZ STOP FLAMIGNG!\n", "Vampire and I ran up the stairs looking for Dumbledore. We were so scared.\n", "“Dumbledore Dumblydore!” we both yelled. Dumbledore came there.\n", "“What is it that you want now you despicable snobs?” he asked angrily.\n", "“Volsemort has Draco!” we shouted at the same time.\n", "He laughed in an evil voice.\n", "“No! Don’t! We need to save Draco!” we begged.\n", "“No.” he said meanly. “I don’t give a darn what Voldemort does to Draco. Not after how much he misbehaved in school especially with YOU Ebony.” he said while he frowned looking at me. “Besides I never liked him that much anyway.” then he walked away. Vampire started crying. “My Draco!” he moaned. (AN: don’t u fik gay guyz r lik so hot!)\n", "“Its okay!” I tried to tell him but that didn’t stop him. He started to cry tears of blood. Then he had a brainstorm. “I had an idea!” he exclaimed.\n", "“What?” I asked him.\n", "“You’ll see.” he said. He took out his wand and did a spell. Then…… suddenly we were in Voldemprt’s lair!\n", "We ran in with our wands out just as we heard a croon voice say. “Allah Kedavra!”\n", "It was……………………………….. Voldemort!\n", "AN: fuk off PREPZ ok! Raven fangz 4 helpin agen. im sory ah kudnt update but I wuz derperessd n I had 2 go 2 da hospital kuz I slit muh rists. PS im nut updating til u giv me 10 god revoiws!\n", "WARNING: SUM OF DIS CHAPTA IS XTREMLY SCRAY. VIOWER EXCRETION ADVISD.\n", "We ran to where Volcemort was. It turned out that Voldemort wasn’t there. Instead the fat guy who killed Cedric was. Draco was there crying tears of blood. Snaketail was torturing him. Vampire and I ran in front of Snaketail.\n", "“Rid my sight you despicable preps!” he shouted as we started shooting him with the gun he Then suddenly he looked at me and he fell down with a lovey-dovey look in his eyes. “EbonyIloveyouwiluhavesexwithme.” he said. (in dis he is sixteen yrs old so hes not a pedofile ok)\n", "“Huh?” I asked.\n", "”Enoby I love you will you have sex with me?” asked Snaketail. I started laughing crudely. “What the fuck? You torture my bf and then you expect me to fuck you? God, you are so fucked up you fucking bastard.” I said angrily. Then I stabbed him in the heart. Blood pored out of it like a fountain.\n", "“Nooooooooooooo!” he screamed. He started screaming and running around. Then he fell down and died. I brust into tears sadly.\n", "“Snaketail what art thou doing?” called Voldemort. Then…… he started coming! We could hear his high heels clacking to us. So we got on our broomsticks and we flew to Hogwarts. We went to my room. Vampire went away. There I started crying.\n", "“What’s wrong honey?” asked Draco taking off his clothes so we could screw. He had a sex-pack (geddit cuz hes so sexah) and a really huge you-know-what and everything.\n", "“Its so unfair!” I yielded. “Why can’t I just be ugly or plain like all da other girls and preps here except for B’loody Mary, because she’s not ugly or anything.”\n", "“Why would you wanna be ugly? I don’t like the preps anyway. They are such fucking sluts.” answered Draco.\n", "“Yeah but everyone is in love with me! Like Snape and Loopin took a video of me naked. Hargrid says he’s in love with me. Vampire likes me and now even Snaketail is in love with me! I just wanna be with you ok Draco! Why couldn’t Satan have made me less beautiful?” I shouted angrily. (an” don’t wory enoby isn’t a snob or anyfing but a lot of ppl hav told her shes pretty) “Im good at too many things! WHY CAN’T I JUST BE NORMAL? IT’S A FUCKING CURSE!” I shouted and then I ran away.\n", "AN: stup flaming ok! btw u suk frum no on evry tim sum1 flams me im gona slit muh ristsz! fangz 2 raven 4 hlpein!\n", "“Ebony Ebony!” shouted Draco sadly. “No, please, come back!”\n", "But I was too mad.\n", "“Whatever! Now u can go anh have sex with Vampire!” I shouted. I stormed into my room and closed my black door with my blood-red key. It had a picture of Marylin Manson on it. He looked so sexy in a way that reminded me of Draco and Vampire. I started to cry and weep. I took a razor and started to slit my wrists. I drank the blood all depressed. Then I looked at my black GC watch and noticed it was time to go to Biology class.\n", "I put on a short ripped black gothic dress that said Anarchy on the front in blood red letters and was all ripped and a spiky belt. Under that I put on ripped black fishnets and boots that said Joel all over them with blood red letters. I put my ebony black hair out. Anyway I went downstairs feeling all sad and depressed as usual. I did sum advanced Biology work. I was turning a bloody pentagram into a black guitar. Suddenly the guitar turned to Draco!\n", "“Enoby I love you!” he shouted sadly. “I dnot care what those fucker preps and posers fink. Ur da most beautiful girl in the world. Before I met you I used to want to commit suicide all the time. Now I just wanna fucking be with you. I fucking love you!.” Then……………. he started to sing “Da Chronicles of Life and Death” (we considered it our song now cuz we fell in love when Joel was singing it) right in front of the entire class! His singing voice was so amazing and gothic and sexxy like a cross between Gerard, Joel, Chester, Pierre and Marilyn Manson (AN: don’t u fink dos guyz r so hot. if u dnot no who dey r get da fuk out od hr!) .\n", "“OMFG.” I said after he was finished. Some fucking preps stared at us but I just stuck up my middle fingers (that were covered in black nail polish and were entwined with Draco’s now) at them. “I love you!” I said and then we started to kiss just like Hilary Duff (i fukin h8 dat bitch) and CMM in a Cinderella Story. Then we went away holding hands. Loopin shouted at us but he stopped cuz everyone was clapping by how sexy we looked 2gether. Then I saw a poster saying that MCR would have a concert in Hogsmede right then. We looked at each other all shocked and then we went 2gether.\n", "AN: u no wut! sut up ok! proov 2 me ur nut prepz! raven u suk u fuken bich gimme bak mah fukijn swteet ur supsd 2 rit dis! Raven wtf u bich ur suposd to dodis! BTW fangz 2 britney5655 4 techin muh japnese!\n", "We ran happily to Hogsmede. There we saw the stage where GC had played. We ran in happly. MCR were there playing ‘Helena’. I was so fucking happy! Gerard looked even sexier than he did in da pictures. Even Draco thought so, I could totally see him getting an erection but it didn’t matter cuz I knew know that we were da only true ones for eachother. I was wearing a black leather minidress and black leather platinum boots with red ripped fishnets. Draco was wearing a black baggy MCR t-shirt and black baggy pants. Anyway, we stated moshing to Helena. We frenched. We ran up 2 the front of the band to stage-dive. Suddenly, Gerard pulled off his mask. So did the others. We gasped. It wasn’t them at all. It was.,……………………….. Volsemort and da Death Dealers!\n", "“Wtf Draco im not going to a concert wid u!” I shouted angrily. “Not after what happened to me last time? Even if its MCR n u no how much I lik them”\n", "“What cause we…you know…” he gadgetted uncomfortbli cause guys don’t like to talk a bout you-know-what.\n", "“Yeah cause we you know!” I yielded in an angry voice.\n", "“We won’t do that again.” Draco promised. “This time, we’re going with an ESCORT.”\n", "“OMFG wtf/ Are you giving into the mainstream?” I asked. “So I guess ur a prep or a Christina or what now?”\n", "“NO.” he muttered loudly.\n", "“R u becoming a prep or what?” I shootd angrily.\n", "“Enoby! I’m not! Pls come with me!” He fell down to his knees and started singing ‘Da world is black’ by GC to me.\n", "I was flattened cause that’s not even a single, he had memorized da lyrks just 4 me!\n", "“OK then I guess I will have to.” I said and then we frenched 4 a while and I went up 2 my room.\n", "B’loody Mary was standing there. “Hajimemashite gurl.” she said happily (she spex Japanese so do i. dat menz ‘how do u do’ in japanese). “BTW Willow that fucking poser got expuld. she failed al her klasses and she skepped math.” (an: RAVEN U FUKIN SUK! FUK U!)\n", "“It serves that fuking bich right.” I laughed angrily.\n", "Well anyway we where felling all deprezzed. We wutsched some goffic movies like Das niteMARE b4 xmas. “Maybe Willow will die too.” I said.\n", "“Kawai.” B’loody Mair shook her head enrgtically lethrigcly. “Oh yeah o have a confession after she got expuld I murdered her and den loopin did it with her cause he’s a necphilak.”\n", "“Kawai.” I commnted happily . We talked to each other in silence for da rest uv da movie.\n", "“OH HEY BTw, im going to a concert with drako tonight in Hogsmeade with mcr.” I sed. “ I need to wear like da hotset outfit EVA.”\n", "B’Loody Mairy Nodded ENREGeticALLlY. “Omfg totally lets go shopping.”\n", "“In Hot Topic, right?” I asked, already getting out my spshcial Hot Topic Loiyalty carde.\n", "“No.” My head snaped up.\n", "‘WHAT?” my head spuin. I could not believe it. “B’Loody Mary are u a PREP?”\n", "“NOOOO!NOOOO!” She laughed. “I found some cool goffic stores near Hogwarts that’s all.”\n", "“Hu told u abut them” I askd sure it would be Drako or Diabolo or Vampire(don’t even SAY that nam to me!). Or me.\n", "“Dumblydore.” She sed. “Let me just call our broms.”\n", "“OMFFG DUMBLYDORE?” I asked quietly.\n", "“Yah I saw the map for Hogsmeade on his desk.” She told me. “Come on let’s go.”\n", "We were going in a few punkgoff stores SPECIALLY for the concerts in Hogsmeade. The salesperson was OMG HOTTER THAN GERARD EXCEPT NOT CAUSE THAT’S IMPOSSIBLE and he gave me a few dresses. “We only have these for da real goffs.”\n", "“Da real goffs?” Me and B’Loody Mary asked.\n", "“Yah u wouldn’t believe how many posers ther are in this town man! Yesterday loopin and snap tried to buy a goffic camera pouch.” He shook his head. “I dint even no they had a camera.”\n", "“OMFG NO THEIR GONNA SPY ON ME AGAIN!” I cried, running out of the changing room wearing a long black dress with lots of red tulle coming out and very low-cut with a huge slit.\n", "“Oh my satan you have to buy that outfit” The salesperson said.\n", "“Yeah it looks totlly hot.” said B’Loody Mary.\n", "“You know what I am gona give it to you free cause u look really hot in that utfit. Hey are you gonna be at the concert tonight?” he asked.\n", "“Yeah I am actually.” I looked back at him. “Hey BTW my name’s ebondy dark’ness dementia TARA way what’s yours?”\n", "“Tom Rid.” He said and ran a hand through his black-dyed hair. “maybe I’ll see you there tonight.”\n", "“Yeah I don’t think so cause I am going there with my bf drako you sick perv!” I yelled angrily, but before he could beg me to go with him, Hargrid flew in on his black broom looking worried. “OMFG EBONDY U NEED OT GET BACK INTO THE CASTLE NOW!”\n", "AN: I sed stup flming da stryo! if ur a prep den dnot red it! u kin tel weder ur a prep or not by ma quiz itz on ma hompage. if ur not den u rok. if u r den FOOOOOK UFFFFFFFFFF! pz willo isn’t rely a prep. Raven plz do dis il promis 2 giv u bak ur postr!\n", "Tom Riddle gave us some clothes n stuff 4 free. He said he wud help us wif makeup if he wunted koz he was relly in2 fashin n stuff. (hes bisezual). Hargird kept shooting at us to cum back 2 Hogwarts. “WTF Hargrid?” I shouted angrily. “Fuck off you fjucking bastard.” Well anyway Willow came. Hargird went away angrily.\n", "“Hey bitch you look kawaii.” she said.\n", "“Yah but not as kawaii as you.” I answered sadly cause Willow’s really pretty and everything. She was wearing a short black corset-thingy with blood red lace on it and a blak blood-red miniskirt, leather fish-nets and black poiny boots that showed off how pale she wuz. She had a really nice body wif big bobs and everything. She was thin enouff 2 be anorexic.\n", "“So r u going 2 da concert wif Draco?” she asked.\n", "“Yah.” I said happily.\n", "“I’m gong with Diabolo.” she anserred happily. Well anyway Draco and Diabolo came. They were both loking extremely hot and sexy and u could tell they thoufht we were ot 2. Diabolo was wearing a black t-shirt that said ‘666’ on it. He was wearing tons off makeup jus like Marylin Manson. Draco was wearing black leather pants, a gothic black GC t-shirt and black Vans he got from da Warped tower. B’loody Mart was going 2 da concert wif Dracola. Dracola used to be called Navel but it tuned out dat he was kidnapped at birth and his real family were vampires. They dyed in a car crash. Navel converted to Satanism and he went goth. He was in Slitherin now. He was wearing a black Wurped t-shirt, black jeans and shoes and black hair wif red streekz in it. We kall him Dracula now. Well anyway we al went 2 Draco’s black Mercy-Bens (geddit cuz wer gpffik) that his dad Lucian gave him. We did pot, coke and crak. Draco and I made out. We made fun of dose stupid fuking preps. We soon got there…….I gapsed.\n", "Gerard was da sexiest guy eva! He locked even sexier den he did in pix. He had long raven blak hair n piercing blue eyes. He wuz really skinny and he had n amazing ethnic voice. We moshed 2 Helena and sum odder songz. Sudenly Gerard polled of his mask. So did the other membez. I gasped. It wasn’t Gerard at all! It was an ugly preppy man wif no nose and red eyes... Every1 ran away but me and Draco. Draco and I came. It was…….Vlodemort and da Death Deelers!\n", "“U moronic idiots!” he shooted angstily. “Enoby, I told u to kill Vampire. Thou have failed. And now……….I shall kill thou and Draco!”\n", "“No no please!” We begged sadly but he took out his knife.\n", "Sudenly a gothic old man flu in on his broomstick. He had lung black hair and a looong black bread. He wus werring a blak robe dat sed ‘avril lavigne’ on da back. He shotted a spel and Vlodemort ran away. It was…………………………………DUMBLYDORE!\n", "AN: I SED STUP FLAMMING! if u do den ur a fuken prep! fangz 2 raven 4 da help n stuf. u rok! n ur nut a prep. fangz for muh sewter! ps da oder eson dumbeldor swor is koz he trin 2 be gofik so der!\n", "I woke up the next day in my coffin. I walked out of it and put on some black eyeliner, black eyesharrow, blood-bed lipstick and a black really low-cut leather dress that was all ripped and in stripes so you could see my belly. I was wearing a skull belly ring with black and red diamonds inside it.\n", "(Da night before Draco and I rent back to the skull (geddit skull koz im goffik n I like deth). Dumbeldore chased Vlodemort away. We flew there on our brooms. Mine was black and the broom-stuff was blood-red. There was lace all over it. Draco had a black MCR boom. We went back to our rooms and we had you-know-what to a Linkin Park song.)\n", "Well anyway I went down to the Grate Hall. There all da walls were painted black and da tables were black too. But you fould see that there was pink pant underneath the black pant. And there were pastors of poser bands everywhere, like Ashlee Simpson and the Backstreet Boys.\n", "“WTF!” I shouted going to sit next to B’loody Mary and Willow. B’loody Mary was wearing a black leather mini with a Good Chraloote t-shirt, black fishnets and black pointy boots. Willow was wearing a long gothic blak dress with blood red writing that was all lacy and came up to your thighs and black boots and fishnets. Vampire, Dracula and Draco came. We started to talk about who was sexier, Mikey or Gerard Way or Billie Joe Armstrong. The boys joined in cause they were bi.\n", "“Those guys are so fucking hot.” Navel was saying as suddenly a gothic old man with a black beard and everything came. He was the same one who had chassed away Vlodemort yesterday. He had normal tan skin but he was wearing white foundation and he had died his hare black.\n", "“……………….DUMBLEDORE?1!” we all gasped.\n", "“WTF?” I shouted angrily. “I thought he was just wearing that to scare Volsemort!”\n", "“Hello everyone.” he said happily. “As u can see I gave the room a makeover. Whjat do u fink about it?”\n", "Everyone from the poser table in Gryiffindoor started to cheer. Well we goths just looked at each other all disfusted and shook our heads. We couldn’t believe what a poser he was!1.\n", "“BTW you can call me Albert.” HE CALLED AS WE LEFT to our classes.\n", "“What a fucking poser!” Draco shouted angrily as we we to Transfomation. We were holding hands. Vampire looked really jealous. I could see him crying blood in a gothic way (geddit, way lik Gerard) but I didn’t say anything. “I bet he’s havin a mid-life crisis!” Willow shouted.\n", "I was so fucking angry.\n", "AN: plz stup flaming da story if u do ur a foken prep n ur jelous ok!11 frum noq un im gong 2 delt ur men reviowz!111 BTW evonyd a poorblod so der!1 fangz 2 raven 4m da help!11\n", "All day we sat angerly finking about Dumbelldore. We were so fucking pissed off. Well, I had one thing to look forward too- da MCR concert. It had been postphoned, so we could all go.\n", "Anyway, I went to the common room sadly to cut classes. Draco was being all secretive.\n", "I asked what it was and he got all mad me and started crying all hot and angsty (rnt sensitve bi guyz so hot).\n", "“No one fucking understands me!1” he shouted angrily as his black hare went in his big blue eyes like Billie Joe in Boulevard of Borken Dreamz. He was wearing black baggy paints, a black MCR t-shirt and a black die. (geddit insted of tie koz im goffik) I was wearing a blak leather low cut top with chains all over it all over it a blak leather mini, black high held boots and a cross belly fing. My hair was al up in a messy relly high bun like Amy Lee in Gong Under. (email me if u wana see da pik)\n", "“Accuse me? What about me!” I growled.\n", "“Buy-but-but-” he grunted.\n", "“You fucking bastard!” I moaned.\n", "“No! Wait! It’s not what it fucking looks like!” he shouted.\n", "But it was to late. I knew what I herd. I ran to the bathroom angrily, cring. Draco banged on the door. I whipped and whepped as my blody eyeliner streammed down my cheeks and made cool tears down my feces like Benji in the video for Girls and Bois (raven that is soo our video!). I TOOOK OUT A CIGARETE END STARTED TO smoke pot.\n", "Suddenly Hargrid came. He had appearated.\n", "“You gave me a fucking shock!” I shouted angrily dropping my pot. “Wtf do you fink you’re doing in da gurl’s room?”\n", "Only it wasn’t just Hargrid. Someone else was with him too! For a second I wanted it 2 b Tom Rid or maybe Draco but it was Dumblydore.\n", "“Hey I need to ask you a question.” he said, pulling out his black wanabe-goffik purse. “What are u wearing to the concert?”\n", "“U no who MCR r!” I gasped.\n", "“No I just saw there was a concert dat a lot of gothz and punx were going 2.” He said. “Anyway Draco has a surprise for u.”\n", "AN: I sed I dnoty ker wut u fink! stof pflamin ok prepz!1 fangz 2 raven 4 da help!1 oh yah btw ill be un vacation in transilvania 4 da nex 3 dayz so dnot expect updatz.\n", "All day I wondered what the surprise was. Meanwhile, I pot on a blak ledder mini, a blak corset with urple lace stuff all over it, an black gothic compact boots. MCR were gong 2 do the concert again, since Volxemort had taken over the last one. I slit my wrists while I moshed 2 MCR in my bedroom all night, feeling excited. Suddenly someone knocked on the door while I was trying on sum black clothes and moshing to Fang u 4 da Venom. I gut all mad and turned it of, but sacredly I hopped inside dat it was Draco so we could do it again.\n", "“Wut de fucking hell r u doing!” I shouted angrily. It was Loopin! “R u gonna cum rape me or what.” I yelled. I was allowed to say dat because Dumblydore had told us all 2 be careful around hem and Snap since he was a pedo.\n", "“No, actshelly (geddit, hell) kan I plz burrow sum condemns.” he growld angrily.\n", "“Yah, so u can fuk ur six-yr-old gurlfriend, huh?” I shouted sarkastikally.\n", "“Fuker.” He said, gong away.\n", "Well anyway, I put on some black eyesharow, black eyeliner, and some black lipstick and white foundation. Then I went. Den I gasped…………………………………………………………….Snake and Loopin were in da middle of da empty hall, doin it, and Dobby was watching!1\n", "“Oh my god you ludacris idiot!” they both shooted angrily when they saw me. Dobby ran away crying. Dey got up, though. Normally I wood have ben turned on (I luv cing guyz do it) but both of them were fuking preps. (btw snake is movd 2 griffindoor now)\n", "“WTF is that why u wanted condoms?” I asked sadistically. (c I speld dat)\n", "“Only you wouldn’t give them to me!” Lumpkin shouted angrily.\n", "“Well you shoulda told me.” I replayed.\n", "“You dimwit!.” Snake began 2 shoot angrily. And then………I took out my black camera and took a pic of them. U could see that they were naked and everything.\n", "“Well xcuse me!” they both shouted angrily. “What was dat al about?”\n", "“It wuz to blackmail u.” I snarked. “So now next time you see me doing it with my boyfriend you cant fuking rat me out or I’ll show dis to Dumbledork. So fuck off, u bastards!” I started to run. They chased me but I threw my wound at them and dey tripped over it. Well anyway, I went outside and there was Vampire, looking extremely fucking hot.\n", "“WTF where’d Draco?” I asked him.\n", "“Oh he’s bein a fucking bastard. He told me he wouldn’t cum.” Vampire said shaking his hed. “U wanna cum with me? 2 the concert?”\n", "Then….. he showed me his flying car. I gasped. It was a black car. He said his dogfather Serious Blak had given it 2 him. The license plate on the front sed MCR666 on it. The one on da back said ‘ENOBY’ on it.\n", "……….I gasped.\n", "We flew to the concert hall. MCR were there, playing.\n", "Vampire and I began 2 make out, moshing to the muzik. I gapsed, looking at da band.\n", "I almost had an orgasim. Gerard was so fucking hot! He begin 2 sing ‘Helena’ and his sexah beautiful voice began 2 fill the hall. ……….And den, I heard some crrying. I turned and saw Draco, cryin in a corner.\n", "AN: fuk u ok! u fokng suk. itz nut ma fult if itz speld rong ok koz dat bich ravern cuz it fok u prepz!1 woopz soz raven fangz 4 da help. btw transilvana rox hrad!1 I even gut 2 go 2 da kasel wer drkola was flimed!\n", "Later we all went in the skull. Draco was crying in da common room. “Draco are u okay?” I asked in a gothic voice.\n", "“No I’m not u fuking bitch!” he shouted angrily. He stated to run out of the place in a suicidal way. I stated to cry cuz I was afraid he would commit suicide.\n", "“Its ok Enoby.” said Vampire comfortly. “Ill make him feel better.”\n", "“U mean you’ll go fuck him wont you!” I shouted angrily. Then I ran 2 get Draco. Vampire came too.\n", "“Draco please come!” he began to cry. Tears of blood came down his pail face. I wuz so turned on cuz I love sensitive bi guyz. (if ur a homophone den fuk of!)\n", "And then………………………….. we herd sum footsteps! Vampire got out his blak invincibility coke. We both gut under it. We saw the janitor Mr. Norris there, shouting angrily with a flashlight in his hand.\n", "“WHOSE THERE!” he shouted angrily. We saw Filth come. He went unda da invisibility cloke and started to meow loudly.\n", "“IS ANY1 THERE!” yelled Mr. Norris.\n", "“No fuck u you preppy little poser sun of a fukcing bich!” Vampire said under his breast in a disgusted way.\n", "“EXCUS ME! EXCUS ME WHO SED DAT!” yelled Mr. Norris. Den he heard Filch meow. “Filth is der any1 unda da cloak!” he asked. Filth nodded. And then……………………….Vampir frenched me! He did it jus as…………………….. Mr. Norris was taking of da cloak!1\n", "“WHAT DA-” he yelled but it was 2 late cuz now we were ruining away frum him. And den we saw Draco crying n bustin in2 tearz and slitting his rists outside of da school.\n", "“Draco!” I cried. “R u okay?”\n", "“I guess though.” Draco weeped. We went back to our coffins frenching each other. Draco and I decided to watch Lake Placid (c isnt da deprezzin) on the gothic red bed together. As I wuz about 2 put in the video, my eyes rolled up and suddenly I had a vision of something that was happening now. There was a knok on the door and Fug and da Mystery of Magic walked into the school!1\n", "AN: stfu! prepz stup flaming ok if u dnot lik it fuk of I no itz mr. noris itz raven’s folt ok!11 u suk!1 no jus kidding raven u fokieng rok prepz suk!1\n", "All day everyone talked about the Misery of Magic. Well anyway, I woke up the next day. I was in my coffin so I opened the door. I was wearing blak lacey leather pajamas. Then I gasped.\n", "Standing in front of me where………………. B;loody Mary, Vampire, Diabolo, Draco, Dracula and Willow!\n", "I opened my crimson eyes. Willow was wearing a tight black leather top with pictures of bloody roses all over it. Under that she wart a black poofy skirt wit lace on it and black gothic boots that was attached to the top. Vampire was wearing a baggy Simple Plan t-shirt and baggy black pants and Vans. Draco was wearing a black MCR t-shirt and blak jeans and a leather jacket. He looked just likee Gerard Way, and almost as fucking sexy. Vampire looked like Joel Madden. B’loody Mary was wearing a tight black poofy gothic dress that she had ripped so it showed of all her clearage with a white apron that said ‘bich’ and other swear words and MCR lyrics on it kind of like one dress I had seen Amy Lee wear once. Darkness (who is Jenny) was there too. She was weaving a ripped gothic black dress with ripped stuff all over it and a lace-up top thing and black pointy boots. So were Crab and Goyle. It turns out that Darkness, Diabolo, Crab and Goyle’s dad was a vampire. He committed suicide by slitting his wrists with a razor. He had raped them and stuff before too. They all got so depressed that they became goffik and converted to Stanism.\n", "“OMFG” I yielded as I jumped up. “Why the fuck are u all here?”\n", "“Enoby something is really fucked up.” Draco said.\n", "“OK but I need to put my fucking clothes on first.” I shouted angrily.\n", "“It’s all right. We have to go now and you look kawaii anyway. Your so fucking beautiful.” Draco said in a sexy voice.\n", "“Oh all right.” I said smiling. “But you have to tell me why your being all erective.”\n", "“I will I will.” he said.\n", "So I just put on some black eyeliner, black lipstick and red eyeshadow and white foundation. Then I came. We all went outside the Great Hal and looked in from a widow. A fucking prep called Britney from Griffindoor was standing next to us. She was wearing a pink mini and a Hilary Duff t-shirt so we put up our middle fingers at her. Inside the Great Hall we could see Dumbledork. Cornelia Fudged was there shouting at Dumbledore. Doris Rumbridge was there too.\n", "“THIS CANNOT BE!” she shouted angrily. “THE SCHOOL MUST BE CLOSED!”\n", "“THE BARK LORD IS PLANNING TO KILL THE STUDENTS!” yelled Cornelia Fudge.\n", "“YOU ARE NOT FIT TO BE THE PRINCIPAL ANY LONGER!” yelled Rumbridge. “YOU ARE TOO OLD AND YOUR ALZHEIMERS IS DANGEROUS! YOU MUST RETRY OR VOLDEMORT WILL KILL YOUR STUDENTS!”\n", "“Very well.” Dumbledore said angrily. “Butt we cannot do this. We can’t close the school. There is only one person who is capable of killing Voldemort and she is in the school. And her name is…………………………………………………………………..Enony Dark’ness Dementia Raven Way.”\n", "Draco, Crab, Goyle, Darkness, Willow, Vampire and B’loody Mary looked at each other………I gasped.\n", "AN: dhut da fok up biches!1 ur jus jelos koz I gut 10000 reviowz!1 fangz 2 raven 4 da help n telin me bout da boox gurlu rok letz go shopin 2getha!\n", "The door opened and Proffesor Rumbridge and Cornelia Fudge stomped out angrily. Then Dumbledum and Rumbridge sawed us.\n", "“MR. WAY WHAT THE BEEP ARE YOU DOING!” Rumbridge shouted angrily. Dumbledore blared at her.\n", "“Oops she made a mistake!” he corrupted her. “She means hi everybody cum in!”\n", "Well we all came in angrily. So did all the other students. I sat between Darkness and Draco and opposite B’loody Mary. Crab and Goyle started 2 make some morbid jokes. They both looked exactly like Ville Vollo. I eight some Count Chocula and drank som blood from a cup. Then I herd someone shooting angrily. I looked behind me it was………Vampire! He and Draco were shooting at eachother.\n", "“Vampire, Draco WTF?” I asked.\n", "“You fucking bustard!” yelled Draco at Vampire. “I want to shit next to her!1”\n", "“No I do!” shouted.\n", "“No she doesn’t fucking like u, you son of a bitch!” yelled Draco.\n", "“No fuck you motherfucker she laves me not you!” shouted Vampire. And then……………… he jumped on Draco! (no not in dat way u perv) They started to fight and beat up each other.\n", "Dumbldore yelled at them but they didn’t stop. All of a sudden…… a terrible man with red eyes and no nose flew in on his broomstick. He had no nose and was wearing a gray robe. All the glass in the window he flew thru fell apart. Britney that fucking prep started to cry. Vampire and Draco stopped fighting….I shopped eating….Everyone gasped. Da room fell silent………………….Volzemort!\n", "“Eboby…..Ebony…….” Darth Valer sed evilly in his raspy voice. “Thou havfe failed ur mission. Now I shall kill thou and I shall kill Vampire as well. If thou does not kill him before then I shall kill Draco too!”\n", "“Plz don’t make me kill him plz!” I begged.\n", "“No!” he laughed crudely. “Kill him, or I shall kill him anyway!” Then he flew away cackling.\n", "I bust into tears. Draco and Vampire came to contort me. Suddenly my eyes rolled up so they looked all cool and gothic. I had a vision were I saw some lighting flash and then Voldremot coming to kill Draco while Draco slit his wrists in a depressed way.\n", "“No!” I screamed sexily. Suddenly I locked up and stopped having the vision.\n", "“Ebony Ebony aure you alright?” asked Draco in a worried voice.\n", "“Yeah yeah.” I said sadly as I got up.\n", "“Everyfing’s all right Enoby.” said Vampire all sensetive.\n", "“No its not!” I shouted angrily. Tearz of blood went down my face. “OMFG what if I’m getting possessed like in Da Ring 2!”\n", "“Its ok gurl.” said B’loody Mary. “Maybe u should ask Proffesor Sinister about what the visions mean though.”\n", "“Ok bich.” I said sadly and den we went.\n", "AN: prepz stup flaming da story ur jus jelous so fuk u ok go 2 hel!11 raven fagz 4 di help!\n", "Well we had Deviation next so I got to ask Proffessor Trevolry about the visions.\n", "“Konnichiwa everybody come in.” said Proffesor Sinister in Japanese. She smelled at me with her gothic black lipstick. She’s da coolest fucking teacher ever. She had long dead black hair with blood red tips and red eyes. (hr mom woz a vampire. She’s also haf Japanese so she speaks it and everyfing. she n b’loody mry get along grate) She’s really young for a teacher. 2day she was wearing a black leather top with red lace and a long goffik black ripped dress. We went inside the black classroom with pastors of Emily the Strong. I raced my hand. I was wearing some black naie Polish with red pentagrams on it.\n", "“What is it Ebony?” she asked. “Hey I love ur nail polish where’d u get it, Hot Topik?”\n", "“Yeah.” I answered. All the preps who didn’t know what HT was gave me weird looks. I gave them the middle finger. “Well I have to talk to you about some fings. When do you want to due it?”\n", "“Ho about now?” she asked.\n", "“OK.” I said.\n", "“OK class fucking dismissed every1.” Proffesor Trevolry said and she let every1 go. “Except for you Britney.” she pointed at Britney and sum other preps. “Please do exorcize (geddit) 1 on page 3.”\n", "“OK I’m having lotz of visions.” I said in a worried voice. I’m so worried is Draco gong 2 die.\n", "Well she gave me a black cryptal ball to lock in. I looked at it.\n", "“What do you c?” she asked.\n", "“I said I see a black gothic skull and a pentagram.”\n", "Suddenly there was a knock at the door. I looked at it. It was Draco. He was looking really sexy wearing a black leather facet, a black gothic Linkin Park t-shirt and blak Congress shoes.\n", "“Okay you can go now, see ya cunt.” said Proffesor Sinister.\n", "“Bye bitch.” I said waving.\n", "I went to Draco and Vampire was sitting next to him. We both followed Draco together and I was so exhibited.\n", "AN: stop flaming ok if u dnot den il tel Justin 2 bet u up!1111 n il tel al da nredz 2 put vrtuz in ur computer!11111111111 FUK UU!1 raven fangz for de help!1\n", "I was so excited. I fellowed Draco wandering if we where going 2 do it again. We went outside and then we went into Draco’s black car.\n", "“Ebony what the fuck did Profesor Trevolry say.” whispered Draco potting his gothic whit hand with bvlak nail polish on mine.\n", "“She said she would tell me what the visions meant torromow.” I grumbled in a sexy voice. He took out a heroin cabaret and spiked it, and gave it to me to spork. He started to fly the car into a tree. We went to the top of it. Draco put on some MCR.\n", "“And all the things that you never ever told me\n", "And all the smiles that are ever gonna haunt me.” sang Gerard’s sexy voice. We started tiling of each other’s cloves fevently. He took of my blak thong and my black leather bar. I took of his black boxers. Then……………………… he put his trobbing you-know-what in my tool sexily.\n", "“OMFG Draco Draco!” I screamed having an orgism. We stated frenching passively. Suddenly………… I fell asleep. I started having a dream. In it a black guy was shooting two goffik men with long black hair.\n", "“No! Please don’t fucking kill us!1” they pleaded but he just kept shooting them. He ran away in a red car.\n", "“No! Oh my fucking god!11” I shouted in a scared voice.\n", "“Ebony what’s wrong?” Draco asked me as I woke up opening my icy blue eyes.\n", "I started to cry and tears of blood went down my face. I told Draco to call Vampire. He did it with his blak Likin Park mobile. Butt the worst thing was who the ppl who were shot in the dream where……………………… Lucian and Serious!111\n", "AN: PREPZ STUP FLAMING SDA STRY OK!1 if u dnot lik da story den go fok urself u fokeng prep! U SUK!111 oh y and I wuznt beng rasist ok!11\n", "A few mutates later Vampire came 2 da tree. He was wearing a blak leather jackson, black leather pants and a Good Chralotte t-shirt.\n", "“Hi Vampire.” I said flirtily as I started to sob. Draco hugged me sexily tryont to comfrot me. I started to cry tears of blood and then told them what happened.\n", "“Oh fuck it!” Vampire shouted angrily. He4 started to cry sadly. “What fucking dick did that!”\n", "“I don’t know.” I said. “Now come on we have 2 tell Dumbledor.”\n", "We ran out of the tree and in2 da castle. Dumblydor was sitting in his office.\n", "“Sire are dads have been shot!” Draco said while we wipped sum tears from his white face. “Enoby had a vision in a dreem.”\n", "Dubleodre started to cockle. “Hahahaha! And How due u aspect me to know Ebony’s not divisional?”\n", "I glared at Dumbledore.\n", "“Look motherfucker.” he said angrily as Dumbeldore gasped (c is da toot of crakter). “U know very well that I’m not decisional. Now get some fucking ppl out there to look for Series and Lucian- pornto!”\n", "“Okay.” he said in a intimated voice. “Were are they?”\n", "I fought about it. Then all of a sudden….. “Longdon.” I said. I told him which street. He went and called some people and did some stuff. After a few mistunes he came back and said people were going out looking for them. After a while someone called him again. He said that they had been found. Draco, Vampire and I all left to our rooms together. I went with Draco to wait in the nurses office while Vampire went to slit his wrists in his room. We looked at each other’s gothic, derperessed eyes. Then, we kissed. Suddenly Serious and Lucian came in on stretchers……………………….and Proffesor Sinister was behind them!1\n", "AN: u no wut!111 I dnot giv a fok wut u prepz fink abot me!1111 so stup flaming da foking story bichez!1111 fangz 2 raven 4 ur luv n sport n help i luv u gurl soz i kodnt update lol I wuz rly deprezzd n I silt muh rists I had 2 go 2 da hospital rraven u rok gurl!11111111111111111111\n", "Every1 in the room stated to cry happly- I had saved them. Drako, Lucian, Serious bond Vampire all came to hug me. The nurse started to give them medicine.\n", "“Cum on Enoby.” said Proffesor Sinatra. She was wearing a gothic blak leader dress with a corset top and real vampir blood on it and fuking black platinum boots. “I have to tell you the fucking perdition.”\n", "I locked at Lucian, Serifs, Drake and Vampire. They nodded.\n", "I smelled happily and went into a dark room. I had changed Profesor Sinister took out some black cards. She started to look into a black crucible ball. She said……………………… “Tara, I see drak times are near.” She said badly. She peered into da balls. “You see, you must go back in time.” She took out a Time-Toner like B’loody Mary had. “When Voldemint was in Hogwarts before he became powerful he gut his hearth borken. Now do you fink he would still become Volxemort if he was in love?” I shook my head. “U must go back in time and sedouce him. It is the only way. If he is still evil then you must kill him. You can come to my room tomorrow and you can do it.”\n", "“Okay.” I said sadly. We did dethz tuch sin. I went outside again sadly.\n", "“What fucking happened?” asked Draco and Vampire.\n", "“Yeah what happened?” asked Darkness, Willow and Boldy Mary?\n", "I was about to tell them butt every1 was there. They were celebrating Lucian and Sirius being fond. Everyone was proud of me butt I jut wonted 2 talk 2 Draco. They were cheesing my name and some reporters were there, trying to interview Dumblydore. A banner was put up. Lotz of fucking prepz were there oviously tring 2 be b goffik wering the HIM sign on their handz- depite them not having akshelly heard of him. Even Mr. Noris looked happy. A blak and red cake had been brought out. Crabbe and Goyke set up some fireworx in the shape of skulls from Wesley’s Whizard Wises.\n", "I put on my Invisibility coke with Vampire and Draco and we sneaked outside 2gether.\n", "AN: I sed stop gflmaing da story it wuz a miskat wen profsor relory sed dat ok!11111111 GO 2 FOKENG HELL!1111 U SUK! fangz 2 fily 4 da help!1! raven hav fun wif kiwi!1111111\n", "We went in2 a blak room. The wallz were blak with portraits of gothic bands lik MCR, GC and Marlin Mason all over them. A big black coffin was in the middle. Red vevlet lined da blak box. There were three chairs made of bones with real skullz in dem. I wuz wearing a blak corset bar wif purple stuff on it, fishnet suckings and a blak leather thong underneath.\n", "I sat down one of da chairs dispersedly. So did Drako and Vampire.\n", "“Are you okay?” Vampir asked potting his albastard hand on mine. He was wearing black nail polish. I was wearing blak nail polish with red crosses on it.\n", "“Yah I guess.” I said sadly. Drako also pot his hand on mine sexily. I smiled sadly with my blak lipstick. “The problem is……………………….I have to seduce Volxemort. Ill have 2 go bak in time”\n", "Draco started to cry sadly. Vampire hugged him.\n", "“Itz okay Eboby.” he said finally. “But what about me? Ur not gonna brake up or anyfing, are you?”\n", "“Of coarse not!” I gasped.\n", "“Really?” he asked.\n", "“Sure.” I said.\n", "We frenched sexily. Vampire looked at us longingly.\n", "Then………… I took off Draco’s MCR shrift and seductvely took of his pants. He was hung lik a stallone. He had replaced the Vampire tattoo that said Enoby on it. Black roses were around it. I gasped. He lookd exactly lik Gerard Way. Vampire took a vido camera. (I had sed it wuz ok b4).\n", "I took of my clothes den we were in 4 da rid of r lif.\n", "We started freching as we climbed into the cofin. He put his spock in my you-know-what and passively we did it.\n", "“I love you Eboby. Oh let me feel u I need 2 feel u.” he screamed as we got an orgasm. We watched Vampire filmed everything perfectly. Suddenly………………………….\n", "“WHAT THE FUCK R U DOING!”\n", "It was………………………….Snope and Profesor McGoggle!111\n", "AN: sot das fok up!11 ur jus jelouz koz ur prepz so fok u!1111 raven u rok gurl fangz 4 da help MCR ROX 666!111111111111\n", "“Oh my satan!1” we screamed as we jamped out of da coffin. Snap and Professor McGoonagle started to shoot at us angrily.\n", "“CUM NOW!1!” Preacher McGongel yielded. We did guiltily. We left the room putting on our clothes. Snoop garbed the caramel and put it in his pocket.\n", "“Hey what the fuck!111” Vampire shooted angrily.\n", "“Yeah buster what the fuck are u going to do with the fucking camera?” Draco demonded all protective, looking at me Longley with his gothic red eyes. “Look, Dumblehor noes your little secret and if u do dis again, then u will go to St Mango’s. So give back da camera!1111”\n", "Hahahaha the Mystery of Mogic thinks he is crazy there is no way dey wil believe him. Snoop laughed meanly.\n", "“Yes so shut your mputh you inlosent fools!” yelled Proffesor McGoggle. She made us cum into a weird room with white stones all around it. There were all these werid tools in it. Draco started to cry all sexy and sexitive (geddit koz hes a sexbom lol tom felnot rulez 4 lif but nut as muxh as gerard ur sex on legz I luv u u fokeng rok mary me!111).\n", "I started to cry tearz of blood (it hapnz in vrampir kroniklz raven sed so ok so fok u!1). Vampire took out a black honkerchief and started to wipe my red eyes.\n", "And then……………….. he and Snoop both took out guns using magic. They started to shoot each other angrily. Non of the ballots gut on eachodder yet. I took out my wand.\n", "“Crosio!” I shouted. Snap stated 2 scram he dropd da gun. But it was too late. Both of them had run out of ballets. I STOPPED DA CURSE. Profesor McGoogle did a spell so that we were all chained up. She took out a box of tools. Den she said “OK Serverus I’m going 2 go now.” She left. Snap started to laugh evilly. Vampire started to cry.\n", "“It’s ok Enoby.” said Draco. “Evergreen will be all right. Remember the cideo u took of Snake.”\n", "Snape laughed again. And then...he took out some whips!1!1111\n", "AN: stop flaming da story ok u dnot no wutz even gona happen ok!1111 so FUL U!111 if u flam u wil be a prep so al flamerz kan kiss muh ass!111 soz 4 soz 4 sayin alzhimers is dongerous but datz da mysteries opinin koz sosiety basically sux. fangz 2 raven u rok bich!111\n", "“No!11” we screamed sadly. Snap stated loafing meanly. He took out a kamera anvilly. Then…………………… he came tords Darko!1! He took sum stones out of his poket. He put da stones around Draco and nit a candle.\n", "“What the fuck r u doing!” I shooted arngrily. Snoop laughed meanly. He polled down his pants. I gasped- there was a Dork Mark on his you-know-wut!11!\n", "He waved his wand and a nife came. He gave da knife 2 me.\n", "“U must stab Vrompire.” he said to me. “If u don’t then I’ll rap Draco!1”\n", "“No you fucking bastrad!1” I yielded.\n", "But den Draco looked at me sadly with his evil goffik red eyes dat looked so depressant and sexy. He lookd exactly like a pentragram (lol geddit koz im a satanist) between Kurt Cobain and Gerard. But then I looked at Vampire and he looked so smexy too wif his goffik black hair. I thought of da time when we screwed and the time I did it with Draco and Dumblydore came and the tame where Draco almost commited suicide and Vampire wuz so sportive.\n", "Snipe laughed angrily. He started to prey to Volxemort. He started to do an incapacitation dancing around the stokes whipping Draco and Vampire. Suddenly an idea I had. I clozd my eyes and using my vampire powers I sent a telepathetic massage to Drako and Vampire so they would destruct Snape.\n", "“Dumbeldork will get u!” Draco shooted.\n", "“Yah just wait ubtil da Mystery find out!11” Vampire yelled. Meanwhile I took out my wand.\n", "“You ridiculus dondderhed!111” Snoop yielded. He took off all of Drico’s clothes. Just as he was about to rape him…………………….\n", "“Crosio!” I shited pointing my wound. Snoop scremed and started running around da room screming. Meanwhile I grabed my blak mobile and sent a txt 2 Serious. I stopped doing crucio.\n", "“You dunderhed!111 Im going to kill-” shooted Snape but suddenly Serverus came.\n", "Snake put the whip behind his bak. “Oh hello Sev I wuz just teaching them sumthing.” he lied. But suddenly Lusian and Profesor Trevolry came in2 da room and they and Serious unlocked the chains and put dem around Snap. Then Profesor Trevolry said ‘Come on Ebony let’s go.”\n", "AN: I sed shut da fok up u quiephs!111 stop kalin ebony a mary su ok u dnot even no wutz gong 2 happen ok so fuk u!1111 fangz 2 muh bff raven 4 di help!1111\n", "“I always knew u were on Voldemort’s side, you sun of a bitca (bufy rox!111).” Serious said 2 Snape.\n", "“No I’m not I was teaching them somefing!1” Snap clamed.\n", "“Oh fucking yeah?” I took some blak Volremortserum out of my poket and gave it to Serverus. He made Snap dirnk it. He did arngrily. Then Luscious took out a tape recorder and started playing it while he did curses on Snap. Then Proffesor Sinister and Lucian made us get out wif them while Snape told his secretes. Lucian took Vampure and Draco to the nurse after thanking me a millon times. Profesor Trevolry took me to a dark room. Now I wuz going to go back in time to sedouce Volxemort. Moving posters of MCR and Nrivana were all over. Hermoine, Darkness and Willow came too. B’loody Mary gave me a blak bag from Tom Rid’s store.\n", "“Whatz in da bag?” I asked Profesor Trevolry.\n", "“U will c.” she said. I opened thee bag. In it was a sexy tite low-smut black leather gothic dress. It had red korset stuff and there was a silt up da leg. I put it on. My frendz helped me put on blak fishnetz and blak pointy boots Willow had chosen. Willow and Darkness helped me put on black eyeliner and blod-red lipshtick.\n", "“You look fucking kawaii, bitch.” B’loody Mary said.\n", "“Fangs.” I said.\n", "“Ok now you’re going to go back in tim.” said Proffesor Sinister. “U will have to do it in a few sessionz.” She gave me a blak gun. I put it in a strap on my fishnetz like in Redisnet Evill. Then she gave me a black time-tuner. “After an hour use da time torner to go back here.” Proffesor Trevolry said. Then she and B’loody Mary put a Pensive in front of me. Every1 went in front of it.\n", "“Good luk!1” Everryone shooted. Darkess and Willow gave me deth’s touch sin. Then……….. I jumped sexily in2 da Pensive.\n", "Suddenly I was in fornt of teh School. In front of me wuz one of da sexiest goth guyz I had ever seen. He was wering long blak hair, kinda like Mikey Way only black. He had gren eyes like Billie Joe Amstrung and pale whit skin. He wuz wearing a blak ripped up suit wif Vans. It was…………………….Tom Bombodil!1111\n", "AN: I sed stup fflaming I no his nam iznt tom bodil dat wuz a mistak!1111 if u dnot lik de story den u kan go skrew urself!11111 U SUK!111111\n", "“Hi.” I said flirtily. “Im Enoby Way da new student.” I shok my pale handz wif their blak noil polish wif him.\n", "“Da name’s Tom.” he said. “But u kan call me Satan. Datz ma middle nam”\n", "We shok hands. “Well come on we have 2 go upstairs.” Satan said. I followed him. “Hey Satan……..do u happen to be a fan of Gren Day?” (sinz mcr and evinezenz dont exist yet den) I asked.\n", "“Oh my fuking god, how did u know?” Satan gasped. “actually I like gc a lot too.”(geddit coz gc did that song I just wanna live that’s ounded really 80s)\n", "“omg me too!” I replied happily.\n", "“guess what they have a concert in hogsment.” satan whispered.\n", "“hogsment?” I asked.\n", "“yeah that’s what they used to call it in these time before it became Hogsmeade in 2000.” he told me all sekrtivly. “and theres a really cool shop called Hot-“\n", "‘topic!” I finshed, happy again.\n", "He froned confusedly. “noo its called Hot Ishoo.” He smiled skrtvli again. “then in 1998 dey changd it to hot topic.” he moaned.\n", "“ohh.” now everything was making sense for me. “so is dumblydor your princepill?” I shouted.\n", "“uh-huh.” he looked at his black nails. “im in slitherin’”\n", "“OMfG SHME TOO!” I SHRIEDKED.\n", "“u go to this skull?”(geddit cos im goffik) he asked.\n", "“yah that’s why im here im NEW.” I SMELLED HAPPili.\n", "Suddenly dumblydore flew in on his broomstuck and started shredding at us angrily. “NO TALKING IN THE HALLS!” he had short blonde hair and was wearing a polo shirt from Amrikan ogle outfters. “STUPID GOFFS!”\n", "satan rolled his eyes. “his so mean to us goffs and punks just becose we’re in slytherine and we’re not preps.”\n", "I turned around angrily. “actually I fink mebe its becos ur da barke lord.”\n", "“wtf?” he asked angrily.\n", "“oh nuffin.” I said sweetly.\n", "then suddenlyn………………. the floor opened. “OMFG NO I SCEAMED AS I FEEL DOWN. everyone looked At ME weirdly.”\n", "“hey where r u goin?” satan asked as I fell.\n", "I got out of the hole n it was bak in the pensive in professor trevolry’s classroom. dumblydum wuz dere. “dumblydore I think I just met u.” I said.\n", "“oh yeah I rememba that.” dumblydor said, trying to be all goffik.\n", "sinister came in. “hey dis is my classroom wait wtf enoby what da hell r u doing?”\n", ":”um.” I looked at her.\n", "“oh yeaH I forgot bout that.”\n", "“wth how?” I screamed forgetting she was a teacher for a second. but shes a goff so its ok.\n", "professor sinster looked sad. “um I was drinking voldemortserum.” she started to cry black tears of depression. dumblydum didn’t know about them.\n", "“hey r u crying tears of blood?” he asked curiously, tuching a tear.\n", "“fuck off!” we both said and dumblydum took his hand away.\n", "professor sinster started crying again in her chair, sobbing limpid tears. “omfg enoby…I think im addicted to Voldemortserum.”\n", "AN: SEE U FOKKING PREPZ GO FOK URSELXXZ DATZ SERUS ISSUZ 2O GO 2 HELL!1111112\n", "AN: I sed shut up itz nut my folt ok if u don’t lik da story den ur a prep so fuk u flamerz!1111 ps im nut updating ubtil u giv me fiv god reviewz nd diz tim I men it!111111 U SUK!1111 fangz raven 4 di help il promiz to help u wif ur story lolz1\n", "“Oh my fuking god!1” I shooted sadly. “Shud we get u 2 St Manga’s, bitch?”\n", "“Hel no!” she said. “Lizzen Egogy, I need ur help. Nex tim u go bak in tim, do u fink u kod ask Tom Andorson 4 sum help?”\n", "“Sure I said sadly. I went outside the door. Draco was there!111 He wuz wearing a big blak GC tshit which wuz his panamas.\n", "“Hey Sexxy.” I said.\n", "“How’d it go Enoby?” he asked in his voice was so sexy and low kinda like Gerard Way when hes talking.\n", "“Fine.” I reponded. We stared 2 go bak in2 da dorm.\n", "“How far did u go wif Satan?” Drako asked jealously.\n", "“Not 2 far, lol.” I borked.\n", "“Will you hav to do it with him?” Draco asked angstily.\n", "“I hop not 2 far!111” I shouted angrily. Den I felt bad 4 shooting at him. I said sorry. We frenched.\n", "“What happened 2 Snipe?” I growled.\n", "“U will see.” Draco giggled mistressly. He opened a door……………Snap nd Lumpkin werz there!11 Serious waz pokering dem by staging dem wif a blak nife.\n", "“NOOOO PLZ!1111” Lumpkin bagged as Serious started 2 suk his blood. I laffed statistically. I tok some photons of him and Snap bing torqued. (ok I no dis iz men but fink abot it ppl dey r pedoz nd Snap trid 2 rap dem and neway sadiztz rok haz any1 seen shrak atak 3 lolz). We took sum of Snipe’s blod den Drako and I went bak 2 our roomz. We sat on my goffik blak coffin. My cloves were kinda drity so I pot on a blak leather outfit fingie kinda like da 1 Suelene haz in Undreworld. (if u haven’t herd of it den FUK U!111) . I put on some blak platform high heelz. Darko put on ‘desolition liverz’ by MCR. Den………………………………………….we storted 2 take of eachotherz clozez. I tok of his shit nd he had a six-pak, lolz. We started 2 mak out lik in Da Grudge. He pot his wetnes in my u-know-what sexily. I gut an orgy.\n", "“Oh Draco!111111!1 Oh mi fuking gud Draco!1111” I screemed passively as he got an eructation.\n", "“I luv u TaEbory.” he whispred sexily and den we fel aspleep lol.\n", "AN: SHOT DA FOK UP PREPZ!1111 hav u even red de story!11 u r proly al just prepz nd posrs so FUK U!111 fangz 2 raven 4 da help!1\n", "I wook up in da coffin de next day. Draco waz gone. I got up and put on a blak tight sexah drsss that was all ripped at da end. There wuz red korset stuff going up da fornt and da bak and it came up 2 my knees. There wuz a slit in da dress lik in mr & mr simth. I pot on ripped blak fishnets and blak stilton bo-ots. Suddenly…………………. Sorious cocked on da door. I hopened it.\n", "“Hi Ibony.” he said. “Gezz wut u have 2 cum 2 Profesor Sinistor’s office.”\n", "“Ok.” I said in a deprezzd voice. I had wanted to fuk Draco or maybe lessen to MCR or Evonezcence. I came anyway.\n", "“So what the fuck happened 2 Snipe and Loopin?” I asked Sorious flirtily.\n", "“I fucking tortured them.” he answered in a statistic way. “They r in Abkhazian now, lol.”\n", "I laughed evilly.\n", "“Where r Draco and Vampira?” I muttered.\n", "“Dey are xcused form skool 2day.” Sodomize moaned sexily. “Rite now they are watching Da Nigtmare b4 Xmas.”\n", "We went into da office. Proffesor Sinister was there. She was wearing a goffik blak dress that was all ripped all over it kinda lik da one Amy Lee wears in this pic\n", "( http/ She wuz drinking some Volximortserum.\n", "She took out da Pensiv and the time-torner.\n", "“Enoby, you will have to do anozzer session now. Also I need u to get me da cure 4 being adikited.” she said sadly. “Good luck. Fangz!”\n", "And then……….I jumped into the Prinsive again. Suddenly I looked around……………I was in da Grate Hall eating Count Chorcula. It was mourning. I was sitting next to Satan. On a table was a tall gottik man wif long blak hair, pail skin and blue eyes wering a suit and blak Cronvrese shoes. He looked just like Charlyn Manson. I noticed……he was drinking a portent.\n", "“Whose he!11” I asked.\n", "“Oh, datz Profesor Slutborn.” Satan said. “He’s da Portents teacher…………..Ebony?”\n", "“Yah?” I asked.\n", "“Did u know dat Marylin Mason is playing in Hogsemade tonight? And they r showing The Exercise at da movies b4 dat.”\n", "“Yah?”\n", "“Well…...want 2 go 2 da contort and da movie wif me?”\n", "AN: fangz 2 suzi 4 da idea!1 u rok! fuk of prepz!11111111 fangz 2 raven 4 di help u rok gurl!1 ps im gong 2 end da stroy rlly sun so FUK U!111 oh yah nd if u no eny gofik namz plz tel me koz I ned 1 4 serius!1 fangz.\n", "I went in2 da Conmen Room finking of Satan. Suddenly I gasped………………..Draco wuz there!111\n", "I grasped. He locked as hut as eva werring blak ledder pants, a blak Lonken Prak t-shrit and blak eyeliner.\n", "“Draco what da fuk r u dong!111111” I gosped.\n", "“Huh?” he asked. Then I remembred. It wuzn’t Draco. It was Lucan!1 He stil had two arms.\n", "“Oh hi Lucian!1” I sed. “Im Ebony the new student lol we shook handz.”\n", "“Yah Satan told me abot you.” Lusian said. He pinted to a groop of sexxxy gottik guyz. They where siting in a corner kutting. It wuz Serious, Vampire’s dad and………………Snap! All of them were wearing blak eyeliner and blak Good Chralootte band shirts. “Lizzen I’m in a goth band wif those guys.” he said. “Were playing 2nite at da Marylin Mason show as back-up.\n", "“ORLY.” I ESKED.\n", "“Yeah.” he said. “Were calld XBlakXTearX. I play teh gutter. Spartacus plays da drums” he said ponting to him. “Snap plays the boss. And Jamez plays the guitar to even fo we call him Samaro, after Samara in da ring.”\n", "“Hey bastards.” I told them they gave me Dethz tuch sin. Suddenly I gasped again. “But don’t u have a lead singer!” I asked. Lucian looked dawn sadly.\n", "“We uzd to but she did. She contempted suicide by silting her rists.”\n", "“Oh my fuking god!11 Datz so fuking sad!1” I gasped.\n", "“Its okay but we need a new led snigger.” Samaro said.\n", "“Wel………..I said Im in a bnad myself.”\n", "“Rilly?” asked Snap. I cudnt belive it. He used 2 b goffik!111\n", "“Yeah were called Blody Gothik Rose 666. Do u wanna hr me sing?”\n", "Yeah said everyone. So the guys tok out der guitarz. They began to pay a song bi (geddit koz bi guyz r sooo sexah!11) Gurn Day.\n", "“I wok dis empt stret on da bolevrad of broken dremz.” I sang sexily (I dnot own da lyrikz 2 dat song).. Every1 gasped.\n", "“Enopby? Will u join da band? Plz!1” begged Lucian, Samoro, Serious and Snap.\n", "“Um…….ok.” I shrugged. “Are we gong to play tonight?”\n", "“Yah.” they said.\n", "“Ok.” I said but I new dat I had 2 get a new outfit. I walked outside wondering how I kud go forward in time. Suddenly someone jumped in fornt of me. It wuz…..Morty Mcfli!1 He was wering a blak bnad tshrit and blak bagy jeans.\n", "“What da hell r u dong here!11” I asked.\n", "“I wil help u go frowad in tim Enoby.” he said siriusly Den……….he took out a blak tim machine. I went in2 it and……………………..sudenly I wuz forward in tim!111\n", "AN: I sed stop flaming ok!111111111 I bet u r al proly old srevinty yr oldz!111 ps PORTERSUZ UR A PREP!1 o ya nd fangz 2 raven 4 di help!111 hav fun in englond gurl!11111\n", "I loked around in a depresed way. Suddenly I saw Profesor Sinister. B’lody Mary, Socrates and Draco, Vampire and Willow were their to.\n", "“OMFG Sorius I saw u nd Samaro and Snip nd everyone!11111 I kant beleev Snap uzd 2 b goffik!111111”\n", "“Yah I no.” Serious said sadly.\n", "“Oh hey there bitch.” Profesor Trevolry said in an emo voice dirnking some Volxemortserom.\n", "Hi fuker.” I said. “Lizzen, Satan asked me out to a gottik cornet and a movie so I need a sexah new outfit for da date. Also I’m playng in a gothic band so I need an ootfit for that too.”\n", "“Oh my satan!1” (geddit lolz koz shes gofik) gasped B’lody Mary. “Want 2 go to Hot Topik to shop 4 ur outfit?”\n", "“OMFS, letz have a groop kutting session!11” said Profesor Trevolry.\n", "“I can’t fucking wait 4 dat but we need 2 get sum stuff first.” said Willow.\n", "“Yah we need sum portions for Profesor Trevolry so she wont be adikted 2 Volxemortserum anymore nd also………….sum luv potion 4 Enoby.” Darko said resultantly.\n", "“Well we have potions klass now.” Willow said so let’s go.\n", "We went sexily to Potionz class. But Snap wasn’t there. Instead there was…………………………………………Cornelio Fuck!11111\n", "“Hey where the fuck is Dumblydore!111” Draco shouted angrily.\n", "“STFU!1” shooted Cornelia Fuck. “He is in Azkhabian now wif Snip and Loopin he is old and week he has kancer. “Now do ur work!111”\n", "My friendz and I talked arngrily.\n", "“Can you BELEVE Snap used to be gottik!1” Vampire asked surprisedly.\n", "“DATZ IT!11” CORNELIO FUK SHOOTED ARNGRILY. “IM GETTING PROFESOR BRIDGE!111”\n", "He stomped out angrily.\n", "Mi frendz and I began talking again. I began to drink some blod mixed wif beer. Suddenly I saw Hargrid in da cupboard.\n", "“WTF is he doing?” I asked. Then I looked at Draco. He wuz wearing tonz of eyeliner nd he locked shexier den eva. Suddenly……………“HARGRIF WUT DA FOK R U DOING!11” he shooted.\n", "I looked around…………….Hairgrid wuz putting sumfing in my glass of blod!11 Darko and Vampire started 2 beat him up sexily.\n", "“God u r such a posr!1” I shooted at Hairgrid. Suddenly I looked ar what he was putting in da blood. It was………………Amnesia Portion!111\n", "AN: OK EVRYBODY IM GONG ON VOCATION ON DA FRIST OF JULY SO IM EEDER GONNA END DA FIK OR UPDAT IT IN WEEX. fangz!1 oh yah nd prepz stop flaming sa story!11 raven fangz 4 da help c ya gurl afta vocation!11\n", "DARKO’S PONT OF VIEW LOL\n", "Vampire and I chaind Hairgrid 2 da floor.\n", "“Oh mi fucking satan!11” Enoby said. She wuz so hot. “Maybe I cud uze Amnesia potion 2 make Satan foll in love wif me faster!1”\n", "“But u r so sexy and wonderful aneway Tata,” said Vampire. “Why would u need it?”\n", "“To make everyfing go faster lol.” said Enoby.\n", "“But you wont have to do it wif him or anyfing, will u?” I asked jelosly.\n", "“OMFG u guyz r so scary!11” said Britney, a fucking prep.\n", "“Shut the fuk up!1” said Willow.\n", "“Ok well anyway lets go 2 Profesor Trevolry’s room.”\n", "Draco, Ebory and I went to Profesor Siniater’s room. But Profesor Sinister wasn’t there. Instead Tom Rid was.\n", "Oh hi fuckers he said. Lizzen, I got u sum kewl new clovez.\n", "I took out da cloves from da bag. It was a goffik blak leather miniskirt that said ‘666’ on da bak, black stilton bootz, blood red fishnetz and a blak corset.\n", "“OMG fangz!” I said hugging him in a gothic way. I took da clothes in da bag.\n", "“OK Profesor Sinister isnt hr what the fuk should we do?” asked Draco. Suddenly he loked at a sign on da blak wall.\n", "“Oh my fuking satan!1” I screamed as I read it. On it said Evry1 Profesor Sinister is away. She is too gottik she is in Azkhabian now. Classes shal be taught by Dubledork who is bak but he shall not be principal 4 now. Sincerely Profesor Rumbridge.\n", "“OMFG!111” I shoted arngrily. “How could they do that!11”\n", "Suddenly Dumblydore came.\n", "“WHAT DA HELL R U DONG IN MY OFICE!1” he began to shoot angrily. Sudwenly I saw Morty Mcfly’s blak tim machine!111 I jumped seductivly in2 it leaving Draco and Vampire. Sudenly I wuz back in tim!11 I looked around. It was……………Profesor Slutborn’s efface! I sneaked around. Suddenly I saw da Amnesia potion on his desk. It wuz blak wif blood-red pentagramz in it. It was the shape of a cross. I put it in my poket. Suddenly da door opened it wuz……..Profesor Slutgorn!11\n", "OMG wut r u doing fuker he shooted angrily I don’t kno wut da fuk r u DOING I SHOUTED ANGRILY.\n", "“Oh sorry I wuz just looking around koz I thought it wuz class.” you said finally hoping he couldn’t c da potion in ur pocket.\n", "“Oh ok u can go now.” said Profesor Slutborn.\n", "You went to the conmen room after putting on my clothes. Silas, Samaro and Snap were there practicing Vampirez will Never Hurt U by MCR.\n", "“Oh hi you guys.” I said seductively. “Wheres Satan?”\n", "“Oh he’s cumming.” said Serious. “BTW u can kall me Hades now.” Suddenly Satan came. He was wearing a smexxy blak leather Jackson, blak congres shoes, a Slipnot t-shirt and a blak tie.\n", "“Ok I will see you guyz at da concert.” I said and then I went with Satan.\n", "AN: wut doez every1 fink if I end da strory and den I add sum more 2 it after vocation? oh yah asnd prepz stup flaming if u dnot lik dat story den take muh quiz ok den u wil c if ur gofik or not!1111111\n", "Satan and I walked 2 his car. It wuz a blak car wif pentagrams all over it. On da license plate said 666 just lik Draco’s car. I went in it seduktivly. Stan started 2 drive it. We talked about Satanism (lolz he wuz named after Satan), kuttting, musik and being goffik.\n", "“Oh my satan, Gerard is so fuking hot!11” Volxemort agreed as we smoked sum weed. (koz bi guyz r hot dey r so sensitive I luv dem lol goez fux a bi guy)\n", "“Lol, I totally decided not 2 comit suicide when I herd Hilena.” I said in a flirty voice. “……….Hey Satan do u know da cure 4 when ppl r adikted 2 Volxemortseruem?”\n", "“Well………………” he thought. “I fink u have 2 drink Vampire blod.”\n", "Suddenly Volxemort parked da car behind a blak movie theater. Satan and I walked outside. We went in2 da movie tether were they were showing da Excercist. In it a boy and a gurl were doing it sudenly a cereal killer came lol. Satan and I laughed at da blood koz we’re sadists.\n", "While Satan was watching da movie, I had an idea. I took Satan’s gothic blak Nightmare b4 Christmas cigar sexily from his poket and put sum Amnesia potion in it. I put it bak in his blak Emile the Strange bag. Satan turned arund and started 2 smoke it. Blak cloudz wif red pentagramz ind em started 2 fly around everywhere.\n", "“OMG!111” Satan said jumping up. I gasped koz I wuz afraid hed notizd. “Enoby gess what?”\n", "I new that the amnesia had worked.\n", "“Amnesia potion has not been invented yet so it will not work.” He said. “2 badd coz I wanted 2 use sum on u.”\n", "“Kul.” I raised my eye suggestingly. And den………. he tok of my cloves sexily and we started 2 make out. I tok of his shit. He had six-pak justr lik Gerard Way!11 We frenched.\n", "“Xcuze me but u r going 2 have 2 leave!111” shooted da lady behind us she was a prep.\n", "“Fuk u!11” I said. Suddenly…………………. I attaked her suking all her blood.\n", "“Noooooo!11” she screamed. All the preps in da theater screamed but everyone else crapped koz Satan and I loked so cute 2gether. Satan and I started to walk outside.\n", "“Zomg how did u do that?” Voldremort asked in a turned-on voice.\n", "“I’m a vampire.” I said as we went into the car.\n", "“Siriusly?” he gasped.\n", "“Yah siriusly.” I said drinking sum beer. Satan started 2 drive da car. I smelled happily.\n", "“Itz too bad we didn’t get 2 c da rest of the movie, don’t u fink?”\n", "“Yah.” I said as we kised passively. Satan parked in a blak driveway next 2 da place where Draco and I had watched GC for the frist time. We went inside where Marylin Mason wuz playing and started to mosh lol.\n", "“Anti-ppl now uve gone 2 far Jeus Krist Superstar!1111” screamed Marlin on da stage. We did the devil fingers. I started 2 dance really close to Satan. He was so shmexay!1 He looked at me all emo with his gothic red eyes and he looked exactly like Mikey Way. I almost got an orgaism!1 Suddenly Marylin Mason stopped singing.\n", "“I wood like to peasant……………..XBlakXTearX!11” he said. I ran onstage. Lucian, Samaro, Snap and Hades were there. They started 2 play their instilments. I got onstag.\n", "“Wel if u wonted honesty datz all u had 2 say!1111” I sang. (I dnot own da lyerix 2 dat song) My voice sounded lik a pentagram betwen Amy Lee and a gurl version of Gerard Woy. Everyone clappd. Satan got an eructation. “I’M NUT OKAY!1” I sang finaly. Suddenly Lucian started playing da song wrong by mistak.\n", "“OMFG!1” yielded James. “Wut the fuck?”\n", "“Woops im sory!” said Lucian.\n", "“You fuking ashhole!1” James shouted angrily.\n", "“U guys are such prepz!11” Snap said. “Cum on it wuz a mistake!1”\n", "“Yah itz not his fault!11” said Serious.\n", "“No he ruined the fucking song!1” yelled Samaro.\n", "“U guys stop!11” I shotoed angrily but it waz 2 late. They all began 2 fight. Sudenly Samaro took out hiz nife.\n", "“OMFG no!11” shouted Lucan but it wuz 2 late James tried 2 shoot off his arm.\n", "And den……………………………I jumped secxily in front of da bullet!11\n", "“No!111” yielded everyone but it wuz 2 late suddenly everyfing went blak.\n", "Disclaimer: I do not own the HP series and I am not the real XXXbloodyrists666XXX.\n", "AN// I am an extremely immature pathetic idiot girl, I know. Out of boredom, I crack this girl's passy for fun (and it took less than 8 minutes to do it too) and will probably get in a shitload of trouble. Which I probably deserve 'cause I'm being a troll right now. Meh.\n", "I, the American retail wearing british vampire Sue, coughed up blood.\n", "Satan kneeled down beside me.\n", "\"Noooooooooooooooo! Don't die!\"\n", "I gave him a rueful smile. \"I'm sorry. It's something I had to do, to fufill my duty as the noble gothic Mary Sue.\"\n", "Satan sobbed. \"I love you Ebony.\"\n", "\"I love you two. I'll...I'll see you in hell.\" I mumbled, already finding my surroundings fading to black.\n", "B'loody Mary Smith suddenly popped into the room for no apparent reason. She frowned when she realized the room was oddly quiet, but at the sight of Ebony's lifeless body, she screamed. Her face became pale with horror. She screamed for the healers, Dumbledore, Mcgoogle, and every single gothic person she could think of.\n", "Suddenly, a glow started to surround the body of Ebony. Everyone stared in shock. Her body started to lift ever so slowly and then, to everyone's shock, it started to incinerate.\n", "When everyone realized what was happening, they rushed over to try to rescue the body, but it was too late, the Sue became nothing more then a pile of ashes.\n", "A loud resounding of everyone bellowing \"NOOOOOOOOOOOOOOOOOOOOO...!!\" filled the room.\n", "A flash of white light from the ashes then started to bounce around the room. Everyone cowered in fear and were temporarily blinded. When it was all over, things changed.\n", "All the silly goth clothes dropped from everyone's bodies (AN//I will refuse to explain how the hell that happened.) and, in their place, clothes the characters would normally wear in canon appeared on their bodies.\n", "When everyone got over the shock of becoming free of the gofick power, everybody cheered. Everyone started singing 'Ding dong the sue is dead...' Well, that is, until all the HP characters realized the true implications of becoming more canon like again.\n", "All the characters who were supposed to be dead fell to the floor, their bodies cold and lifeless. Harry and Voldemort started dueling. On the left side of the two, the battle of the Light Side and the Dark Side were reaching a climax.\n", "And, because the replacement author also likes to screw around with canon, Draco and Hermione fled the scene and got married.\n", "--------\n", "Meanwhile...\n", "Down in hell, Ebony shed a single tear because of her current situation. A situation that would live on for all eternity. Or at least until the end of fanfiction time.\n", "She lost it all, but she knew she had to remain strong. Nothing would ever break her down.\n", "She looked down over her pale body, and frowned. 'Where are my emo clothes?' She asked herself in confusion.\n", "And then it occured to her...\n", "For her shirt, she was wearing a bright pink polo with a little seagull on the (right or left? I can't remember) side. Below that, she was wearing a denim miniskirt with the \"destroyed\" look on it. Paired underneath that skirt were leggings with a little moose at the bottom. And then Ebony realized, on her shoulder, she was carrying a pretty bag with an eagle on it that said Live Your Life written all over the bag.\n", "Ebony supressed the urge to scream. Here she was decked out in clothes prep to the extreme wearing stuff from Abercrombie and Fitch, American Eagle, AND Hollister.\n", "Panicked, Ebony hastily tried to take off the Hollister polo, but underneath it, there was another Hollister polo underneath. Ebony frowned, and looked under her shirt. All she saw was a bra underneath (dare I point out it's from the Aerie line available at American Eagle?). Ebony tried to remove the shirt again. But to her frustration, there was yet again another polo to replace it.\n", "\"THIS IS UNLOGICAL AND DOES NOT MAKE ANY SENSE!!\" Ebony bellowed out to the air. She failed to see the irony in her statement, how hypocrytical her words were, seeing as she was practically calling the kettle black here.\n", "Ebony slit her writs and mumbled to herself, \"Omigod.\"\n", "/End Crap Fic.\n", "AN: stfu prepz git a lif!111111 U SUCK!11 oh and form now on il be in vocation in englind until lik august so I wont be able 2 update 4 a while, lolz. fangz 2 evry1 hu revoiwed expect da prepz hu flamed FOK U!1 MCR RULEZ 666!111\n", "I woke up in da Norse’s offace on a special gothik coffin. Hairgrid wuz in da bed opposite me in a comma coz Vampir and Draco had bet him up. Mr. Noris was cleaning the room.\n", "“Oh mi satan wut happened!” I screamed. Suddenly Volxemort came. He loked less mean then usual.\n", "“Get the fuk out u fucking bastard!11” I yielded.\n", "“Thou hath nut killd Vampire yet!11” he said arngrily. Sudenly he started 2 cry tearz of blood al selective.\n", "“Volxemort? OMFG what’s wrong!111” I asked.\n", "Sudenly………. Lucian, Profesor Sinister and Serious came! B’lody Mary and Vampire were wif dem. Every1 was holding blak boxez. VOLXEMORT DISAPAERD.\n", "“OMFG Enoby ur alive!111” Scremed Vampire. I hugged him and B’lody Mary.\n", "“What the fuk happened?” I asked dem. “Oh my satan!11 Am I lik dead now?” I gosped.\n", "“Enoby u were almost shot!11” said Serious. “But da ballet could not kill u since u were form anodder time.”\n", "“But fangz anyway!1” said Lucian holding oot his arm. I gasped. He had two arms!\n", "“OMG I cant beleve Vampirz’ dad shot u!1” I gasped.\n", "“Well 2 be honest Snap wuz pozzesd by Snap bak den.” said James.\n", "“Yah he wuz a spy.” Serious said sadly. “He wuz really a Death Dealer.”\n", "“And he wuz such a fuking poser 2!11” said Lucian. “He didn’t even realy no hu GC were until I told him.” Well anyway everyone tarted 2 give me presents. I was opening a blak box wif red 666s (there wuz a dvd of corps bride in it) on it when I gasped. Mr. Noris looked up angrily coz he h8ed gothz.\n", "“Hey haz aneone fuking seen Draco?” I asked gothikally.\n", "“No Draco told me he wood be watching Hoes of Wax.” said Profesor Trevolry. “He duzzn’t know dat ur better. Anyway da norse said u could get up. Cum on!1”\n", "I got up suicidally. Lucian, Serious and Profesor Sinister left. I wuz wearing a blak leather nightgun. Under that I had on a sexxy blak leather bra trimed wif blak lace, with a matching thong that said goffik gurl on the butt and sexy fishnetz that kind hooked on 2 my thong (if u don’t get da idea massage me ill tell u). I put on a blak fishnet top under a blak MCR t-shirt, a blak leather mini with blak lace and congress shoes. I left the hospital’s wings wif B’lody Mary, Willow and Vampire.\n", "“OMFG letz celebrate!11” gasped Willow.\n", "“We can go c Hose of Wax wif Draco!1” giggled Vampire.\n", "“Letz go lizzen 2 GC and kut ourselvz 666!11” said Hermoine. We opened da conmen room door sexily. And den………..I gasped……………………………………… Draco wuz there doing it wif Snap!1111111111111111111111111 He wuz wearing a blak tshirt wif 666 on da front and baggy jeanz.\n", "“U fucking prep!11” we all yielded angrily.\n", "“Yah u betrayed us!111” shooted Vampire angrily as he took out his blak gun.\n", "“No u don’t understand!1” screamed Draco sadly as he took his thingie out of Snake’s.\n", "“No shit u fuking suk u preppy bastard!111” said Willow trying 2 attak him (u rok girl!1). I ran suicidally to my room I sexily took a steak out.\n", "“Enoby no!11111” screamed Draco but it wuz 2 l8 I had slit muh ritsts wif it suddenly everyfing went blak again.\n", "--------\n", "Sincerely,\n", "An-Anon-Author-Who-Will-Silently-Not-Reveal-Her-Identity-Because-She's-A-Coward :P\n", "A.K.A. Just a troll with rocks for brains.\n", "THE IDIOT'S NOTE: Well... this was in the doc area... might as well let the whole world see what the real Tara wanted to show us... Have a nice day!\n", "AN: stfu prepz git a lif!111111 U SUCK!11 oh and form now on il be in vocation in englind until lik august so I wont be able 2 update 4 a while, lolz. fangz 2 evry1 hu revoiwed expect da prepz hu flamed FOK U!1 MCR RULEZ 666!111\n", "I woke up in da Norse’s offace on a special gothik coffin. Hairgrid wuz in da bed opposite me in a comma coz Vampir and Draco had bet him up. Mr. Noris was cleaning the room.\n", "“Oh mi satan wut happened!” I screamed. Suddenly Volxemort came. He loked less mean then usual.\n", "“Get the fuk out u fucking bastard!11” I yielded.\n", "“Thou hath nut killd Vampire yet!11” he said arngrily. Sudenly he started 2 cry tearz of blood al selective.\n", "“Volxemort? OMFG what’s wrong!111” I asked.\n", "Sudenly………. Lucian, Profesor Sinister and Serious came! B’lody Mary and Vampire were wif dem. Every1 was holding blak boxez. VOLXEMORT DISAPAERD.\n", "“OMFG Enoby ur alive!111” Scremed Vampire. I hugged him and B’lody Mary.\n", "“What the fuk happened?” I asked dem. “Oh my satan!11 Am I lik dead now?” I gosped.\n", "“Enoby u were almost shot!11” said Serious. “But da ballet could not kill u since u were form anodder time.”\n", "“But fangz anyway!1” said Lucian holding oot his arm. I gasped. He had two arms!\n", "“OMG I cant beleve Vampirz’ dad shot u!1” I gasped.\n", "“Well 2 be honest Snap wuz pozzesd by Snap bak den.” said James.\n", "“Yah he wuz a spy.” Serious said sadly. “He wuz really a Death Dealer.”\n", "“And he wuz such a fuking poser 2!11” said Lucian. “He didn’t even realy no hu GC were until I told him.” Well anyway everyone tarted 2 give me presents. I was opening a blak box wif red 666s (there wuz a dvd of corps bride in it) on it when I gasped. Mr. Noris looked up angrily coz he h8ed gothz.\n", "“Hey haz aneone fuking seen Draco?” I asked gothikally.\n", "“No Draco told me he wood be watching Hoes of Wax.” said Profesor Trevolry. “He duzzn’t know dat ur better. Anyway da norse said u could get up. Cum on!1”\n", "I got up suicidally. Lucian, Serious and Profesor Sinister left. I wuz wearing a blak leather nightgun. Under that I had on a sexxy blak leather bra trimed wif blak lace, with a matching thong that said goffik gurl on the butt and sexy fishnetz that kind hooked on 2 my thong (if u don’t get da idea massage me ill tell u). I put on a blak fishnet top under a blak MCR t-shirt, a blak leather mini with blak lace and congress shoes. I left the hospital’s wings wif B’lody Mary, Willow and Vampire.\n", "“OMFG letz celebrate!11” gasped Willow.\n", "“We can go c Hose of Wax wif Draco!1” giggled Vampire.\n", "“Letz go lizzen 2 GC and kut ourselvz 666!11” said Hermoine. We opened da conmen room door sexily. And den………..I gasped……………………………………… Draco wuz there doing it wif Snap!1111111111111111111111111 He wuz wearing a blak tshirt wif 666 on da front and baggy jeanz.\n", "“U fucking prep!11” we all yielded angrily.\n", "“Yah u betrayed us!111” shooted Vampire angrily as he took out his blak gun.\n", "“No u don’t understand!1” screamed Draco sadly as he took his thingie out of Snake’s.\n", "“No shit u fuking suk u preppy bastard!111” said Willow trying 2 attak him (u rok girl!1). I ran suicidally to my room I sexily took a steak out.\n", "“Enoby no!11111” screamed Draco but it wuz 2 l8 I had slit muh ritsts wif it suddenly everyfing went blak again.\n", "Idiot's Note: Ugh... I know... terrible... but then again, this wouldn't be called the 'worst fanfic ever if not for the fact that the writing standards meets the level of a day old fetus...\n", "AN: 2 every1 hu kepz flaming diz GIT S LIF!!!!! I bet u proly odnt no hu gerod way is ur proly al prepz and pozers!!!!!!!!11111 neway sum1 hakked in2 mi akkount in November and dey put up my last chaptah but now der is a new 1. im surry 4 nut updating g 4 a while but ive been rilly bizzy. im trying 2 finish da story b4 da new movie kumz out. Im gong on vacation 4 a mons I wont be bak until abott 2 weeks. OMFG drako iz so hot in all da pix 4 da new movie!!!111 I wunted dem 2 put a kameo by geord way lol he hsud play drako. if u flame ill slit muh risztz!!!!!!!!11 raven u rok gurl hav fun in ingland.\n", "When I wook up I wuz in a strange room. I loked around I wuz wearing da same outfit I had when is performed wif XBlakXTearX!!!!!11 I looked arund confusedly. It wuz da Norse’s office but it looked difrent!! On da wall wuz a pik of Marlyin Munzon!!!1111 (just imagin dat he is an 80s goffik band 2 ok koz he is more old den panic?! at da dizcko or mcr) der wuz also a goffik blak Beatles calander with a picture of the beetlez werring iyeliner and blak cloves. On it said ‘1980.’\n", "“OMFG!!! Im back in Tim again!!!!111” I screamed loudly. Suddenly Satan(dis is actually voldimort 4 photo refrenss!). Voldimort wuz wearing a blak leather Jackson, blak tight jeans and fishnet pantz. He looked so sexah I almost had an orgy!!!!11\n", "“OMFG Enoby r u ok.” He asked gothikally.\n", "“Yah Im okay 4 ur in4mation.” I snapped sexily. “OMG am I dedd???” koz I remembered I had jumped in front off da bullet from Jame’s gun. I also rememberd cing Drako doing it wif Snap!!!!111\n", "I guessed dat when I had slit mi wrists I had went bak in tim instead of dieing. I knoew I could go forward in time if I found a time-toner or da tim machine.\n", "“No ur not dead.” Satan reassured suicidally as he smokd a cigarette sexily and smoke came all over his face. “Ur a vampire so u kant die frum a bullet. Cum on now lets go c how Hairy’s dad is doing.”\n", "I noo dat da real reason I didn’t die from da ballet was koz I was from da future. “WTF!!!! James almust shot Luciious!!!” I said indigoally. I knew that James had really ben possezzed, but I didn’t want him2 know I knew.\n", "“Yah I know but he had a headache he wz under a lot of stress.” Satan reasoned evilly.\n", "“I guess that’s ok.” I said because James hadn’t really shot Lucian. Also I noo that Lucian wood now have 2 arms instead of 1. I walked seduktivly outside with Satan. Suddeni I saw a totally sexi goffik bi guy!!!!!11 He had bleched blond hair wiv blak streaks up 2 his ears and he wuz wearing goffik blak iliner, a blak Green Day shirt (it showed billy joel wiv bolnd hair since it was da eighties), blak congress shoes and black baggy pants. He walked in all sexly like Gerrd way in the vido for I Don’t 3 u lyk I did yesterday and you cud see a blak tear on his face lyk da wmn in dat video. “Hey.” He sed all qwietly and goffically.\n", "“Who da fuck is that?” I asked angrly cos I did nut kno him.\n", "“Dis is…Hedwig!!!!!!!!!11” Sed Volximort. “He used to be in XBlackXTearX 2 but he had 2 dropp out koz he broke his arm.\n", "“Hey Hedwig.” I said seductively evn tho I wuz nut tring to b.\n", "“Lol hi Enoby.” He answered but then he ran away bcos he had hair of magical creature. He was humming Welcum 2 da Blak Prade under his breth( I no dat is not 80s but pretend it is ok!!)\n", "“Bye.” I sed all sexily.\n", "“Dat was Hedwig. He used 2 b my boifreind but we broke up.” Satan said sadly, luking at his blak nails.\n", "“OMFG I can get u bak 2gether!” I said fingering something I didn’t know wuz in my pocket- a blak Kute is What we Aim 4 cideo ipod that I could take videos wif (duz ne1 elze no about dem??? dey kik azz!!!!).\n", "“Ok u can 4get about ur class for now, Hedwig. Im going 2 show u something grate!!!!1” I led them to da Great Hall. “Cum on u guys.”\n", "Lucian, James, Serious and Snake were all in da Grate Hall. Lucian woudnt talk wiv James because he had tried 2 shoot him.\n", "“Go fuk urself you fukking douche!” he shouted at him. “Drako is never gong 2 b frends with vampire now!!1”\n", "“Yah go fuck urself Samaro!” Snape agreed but I noo he wuz lying koz it had been his folt James had almost shot Lucian.\n", "“B quiet u guys.” I said sexily. Mi plan waz working oot great. Now I kood make Voldement good wivout doing it with him! Now Vampire’s dad wood never die and “OK Satan and Hedwig, u guys can start making out.” I said and I started 2 film dem wiv da ipod.\n", "“Kool.” said Serious as Voldemort and Hedwig started 2 make out sexily. We watched as tdey started 2 take each odderz cloves off sexily. Samaro, Serious, Snake and Lucian all watched koz dey wer prolly bi. I noo Snape was bi.\n", "“Oh my fukking god!!!! Voldimort! Voldimort!” screamed Hedwig as his glock touched Voldemort’s.\n", "But suddenly everything stopped as da door opend and in kame………………Dumblydore and Mr. Norris!!!!111111111111\n", "AN: omg da new book iz kumming out rlly soon I kant wait!!!1111. I fink dat snap will be really the same person as Volximort koz dey are both haff-blood so dat will explain y he kild dumblydore and he hated hairy!!!!!1111 nd den hairy wil have 2 kommit suicide so voldimort will die koz he will rilly be a horcrox!!!!!111 omg I hope draco nd harry get 2getha dat will be so shmexxy, wont it?? If dey don’t den JKR is hamophobic!!!!!111111 fangz 4 da help wiv facts, medusa u rok!!!111\n", "I sat depressedly in Dumbledork’s office wiv Hedwig, Satan, James, Serious, Snap and Lucian. Dumbledore was sitting in front of us cruelly. He looked more young den he did in da future. He had taken da ipod away and wuz now lizzening 2 a shitty Avril Levine song.\n", "“What da hell is this anyway??” he cackled meanly. I hoped he didn’t find out dat I was frum another time.\n", "“Whatever u do don’t blame Ibony, u jerk.” Satan said.\n", "“Yah, siriusly she was trying to get Satan and Hedwig back together.” Serious said deviantly.\n", "“Be quiet you Satanists.” Dumbledore cockled. “If ur lucky I’ll probably send u all to Akazaban!!! That will teach u to copolate in da Great Hall.” He changed the song on da ipod 2 a n’Sync song. Suddenly I noticed sumfing strong about da Ipod. It was slowly chonging! Dumblydore didn’t notece.\n", "“You fucking poser.” I muttoned.\n", "“I bet you’ve never herd of GC.” James said. Know I knew waht da iPod was chonging in2- Morti McFly’s tim machine!!!!!11\n", "“Shut up Jomes!!!” Drako’s dad shouted.\n", "“Yeah shut up!!!!” Snake said preppily.\n", "“No u shut up Dumblydore!!!!!!!!1111” said Tom.\n", "“I’ve had enough of u Satanists in my school!!!!” shouted Dumbledore spuriously.\n", "Suddenly I grabed da iPod from him. “Evry1! Jump in b4 itz 2 l8!!! I jumped in2 it. But only 1 odder person jumpd in. It was……..Satan.\n", "“You dunderheads!!!!!!!!!!!!!!!!!!!1111111111” screamed Dumbledore wisely as we went.\n", "I looked around. I wuz in da Slitherin conmen room wiv Satan. I was wearing a blak plaid miniskirt with hot pink fishnetz, a sexy blak MCR corset and blak stiletto boots with pink pentagroms on dem. My earrings were blake Satanist sins and my raven hair was all around me to my mid-black.\n", "“Hey kool where iz dis?” he asked in an emo voice.\n", "“Dis is da future. Dumbeldore’s iPod dat he tried to take away from me wuz really also a tim machine.” I told him.\n", "“Kool what’s an ipatch?” he whimpered.\n", "“It’s somefing u use 2 lizzen 2 music.” I yakked.\n", "“OMFG kool wait whatz a 4-letter-wurd 4 dirt?” he esked in his sexah voice.\n", "“Um I guezz sand????” I laid confuesdly.\n", "“Yah I wuz just triinyg to make sure u were stil da same perzon.” He triumphently giggled.\n", "Suddenly some of my friends walked in.\n", "“OMG you’re fucking alive!” said Ginny wearing a blak leather jocket, blak baggy pants and a goffik black Frum First to Last shirt. I explained 2 her why I was alive.\n", "“Konichiwa, bitch.” said Willow. She was wearing a blak corset showing off her boobs with lace all around it and red stipes on it. With it she waz wearing a blak leather miniskirt, big blak boots, white foundation, blak eyeliner, red eyeshadow, and blak lipstick.\n", "“Hey, motherfucker.” Said Diabolo with his red hair. He waz wearing a black P?ATD t-shit and blak baggy pants.\n", "“Hey whose that, Ibony?” B’loody Mary questioned as she walked in wearing a black t-shit with a red pentarom on it with lace at the bottom, red letther pants with blak lace, and black stolettoes.\n", "“Oh its Satan.” I told her and she nodded knowing da truth.\n", "Suddenly Satan started to cry.\n", "“Are you okay Satan?” we asked concernedly.\n", "“OMFG ur from da future!!1! What if u don’t like m anymore koz were from difrent times?????” he asked.\n", "“No I still like you.” I said sexily to him.\n", "“Ok.” He said ressuredly. I let him lizzen 2 Teenagers by MCR on my ipod while I was about to go outside to find out some fingz. I gave Diabolo a signal to keep Satan occupied. Satan fell asleep. I took the iPod. I was about to walk outside. Profesor Sinister ran in!!!!!!!1111 She was wearing a gothic blak minidress with depressing blak stripes, white and blak stripped tights, and red converse shoes. She was wearing LOTS of blak iliner.\n", "“Oh my fucking god, where’s Draco!!!!111 How did Snap get back here!!! I tohot he wuz in Azerbaijan.” I asked sadly.\n", "“Ebony I was so worried abott u but I know you can’t fucking die because you’re a vrompire. Snape came back because that girl Britney freed him. I never liked her she was a bad student.” Trevolry said reassuredly.\n", "“That bitch!!!!!!!11 Did she also free Hargrid and Loopin?” I shouted angrily. I hated Britney because she was a fucking prep.\n", "“Yes they are on the loose at this school. Dumblydore is back Cornelia is on his way to help evry1. Tell evry1 u see to lock themselves in their conman room!!!!!!” Trevolry said worriedly.\n", "“OK. But where’s Dracko???? How cum he was doing it with Snap?????”\n", "“I dunno why but I know he almost tried 2 commit suicide after he saw u almost kill urself.” she said.\n", "“OMG dat’s terrible!!!!!!!!” I gasped. Satan was still asleep, so he couldn’t tell what was going on. Then I said “Lizzen evry1, I have sumthing imptent to do. in hr evry1 stay!!!!!!!!!” wiv dat I ran out.\n", "“Good luck Tara!!!!!!!11” everyone cried.\n", "I ran sexily down the staris in2 da Grate Hall while da portraits around looked at me scaredly. There was hardly ne1 else in the stairs nd tere was an atmosphere of horrer. On da way I saw Britney laughing on da stairs. She was wearing a a slutty pink shirt wiv flowers on it, a blu jean skirt Abercromie and pink stiletoos. She looked jest like a pentagram of those fucking preps Hilery Duff and Lindsey Lohan.\n", "“You fucking bitch!!!!!111” I shouted angrily.\n", "“No, your totally a bitch. Now Voldemort will like totally kill u!” she laughed.\n", "“Crucious!!!!!!!!!1” I shouted selectively pontificating my blak wand and she started screaming koz she was being tortured and I laughed sodistically.\n", "“No!!!!!!1 Help me!!!!!!1 Please!!!!!!!!1” Britney screamed terrifiedly.\n", "I put up my middle finger at her. In her hand I saw da video camera Snape and Lumpin had used to take da video of me. I put the tape of Voldimort doing it with Hedwigg onto it. Then I continued to rown down the stairs with the camera. When I had reached da Grate Hall I saw Vampire Potter. “OMG Vampira!!!!111” I yielded.\n", "We hugged each udder happily. He locked at me wif his gothic red eyes and spiky blak hair. Around them were blak eyeliner and iShadow. His He wus wearing a blak leather Jackson, ledder pants, a Panik at da Disko concert shirt and his blak congress shoes. He looked mor like Joel from Good Charlote than ever. (did u hear der song da river it rox!!!1)“I wus so worried you died!” moaned Vampire.\n", "“I know but Im a vampire lol. When I woke up I wuz back in 1980, so neway I bought Voldimort from when he was yung with me.”\n", "“Where’s Draco?” I asked spuriously.\n", "“Draco? You mean that fukking poser who betroyed you?” Vampir snarkled with anger in his sexy voice.\n", "“I NO BUT WE HAV 2 FIND HIM.” I SED SMARTY.\n", "“I’ll do it den.” Harry said angstily.\n", "“OK.” I argreed. Suddenly……….all da lights in da room went out. And den…….da Dork Mark appeared.\n", "“Oh my fucking satan!!!!!” Harry shouted.\n", "“I fink Voldimort has arrivd.” I sed anxiously. “Fuck, I have to find Draco!!1 I guess we shood separate.”\n", "“Ok.” Vampire sed diapperating. Sadly I ran into the Great Hall.\n", "I walked sexily into the Great Hall. It was empty except for one person. Draco was there!! He sat der in deddly bloom in his blak 666 t-shirt and his baggy blak pants. He had slit his wrists!!!!!111 I felt mad at him for having sexwith Snape but I felt sorry for him. He looked just like Gerard Way with his red eyes and his pale white face.\n", "“Draco are you okay????” I asked.\n", "“I’m not okay.” he screamed depressedly. I thought of the MCR song nd I got even more depressed koz that song always makes me cry. I gave him a pot cigarette and he started to smoke it.\n", "“Oh Draco why did you do it with that fucking bastard Snape?” I asked teardully.\n", "“I-” Draco began to say but suddenly Lupin and Mr. Norris appearated in2 da room!! They didn’t see us.\n", "“Im so glad we me and Snape were freed.” said Loopin.\n", "“Dam, this job would be great if it wasn’t 4 da fukking students!” Mr. Norris argreed.\n", "“Pop addelum!!!!!111” I yielded angrily pointing my wand at them.\n", "“Noooooooo!!!!1” Lupin shouted as chains came on him. Mr. Norris ran away.\n", "“You fukking perv.” I said laughing wiv depths of evil and depressedness in my voice. “Now u have 2 tell us where Voldimort is or I’m gong 2 torture u!!!!”\n", "“I don’t now where he is!!!!1111” said Loopin. Suddenly Satan and Vampire ran in2 da room. Vampir didn’t know who Satan was really.\n", "“Oh my satan, we were so worried about u guys!!1” Vampire said. I looked sexily at Draco with his goffik red eyes with contacts, blak t-shirt that said 666 on it and pale skin like Gerord Way, Vampir with his sexy blak hair and red eyes just like Frank Iero and Satan who looked jist like Brandan Urie then.\n", "I selectively took the caramel from my pocket. And then….. I began frenching Draco sexily. Loopin gasped. Draco began to take all of his cloves off and I could see his white sex-pack. Then Vampire took his own clotes off too. We all began making out 2gther sexily. I took off my blak leather bra, my blak lace thong and the rest of my clothes. Every1 took their glocks out except 4 me im a girl lol. “Oh mi satan!! Draco!!!!” I screamed as he put his hardness in my thingy Den he did da same fing to Harry. I began making out wiv Satan and he joined in. “OMS!!!111” cried Vampire. “Oh Vampire! Vampire!!!” I screamed screamed. “Oh Satan!!!!!” yelled Harry in pleasore. Loopin watched in shock. Wee took turns doing torture curses on him koz we were all sadists. Suddenly……………………………..\n", "………….a big blak car that said 666 on the license plate flew strait through da windows. And Snap wuz in it!!!!!!!11\n", "AN: well I hav noffing 2 say but evrt1 stup glamming ok!!111 if any gofik ppl r reading dis den u rok!!!11 omg I stil kant wait 4 da movie!!!1 tom fleton is so hot lol i hop harry wil bekum gofik koz mi frend told me he iz rlly emo in dis book!!!!1111 omfg im leeving dubya pretty soon kant wait!!! Diz wil prolly be da last chaptah until I kum bak.\n", "“Dat’s mi car!!!!” shooted Draco angrily. But suddenly it was revealied who was in da car. It wuz………….Snape!!!!!\n", "“I shall free you Loopin but first you must help me kill these idiotic donderheads.” he said cruelly from the car as it flew circumamcizing above us. “Ebony Dark’ness Dementia Raven Way must be killed. Den the Dork Lord shall never die!!!!”\n", "“You fucking prep!!!” yelled Draco. Then he loked at me sadly. “I forgot to tell u, Ebony. Snape made me do it with him. I didn’t really have sexx him but he’s a ropeist!!!!”\n", "We all put our clothes on quickly except Satan. We were so scarred!!!!1 But Satan didn’t change. Instead he changed into a man with gren eyes, no nose, a gray robe and white skin. He had changed into………… Voldemont!!!!!!!111\n", "“I knew who thou were all along.” he cackled evilly and sarcastically at me. “Now I shall kill thee all!!!!!!” Thunder came in da room.\n", "“No plz don’t kill us!” pleaded Vampire. Suddenly Willow, B’loody Mary, Diabolo, Ginny, Drocula, Fred and Gorge, Hargrid, McGonagall, Dumblydore, Serious and Lucian all ran in.\n", "“What is da meaning of dis?” Dumblydore asked all angrily and Voldimort lookd away (bcos dumblydore is da only whizard he is scared of.) He did a spell and suddenly his broomstick came to him sexily. Volxemort flew above the roof evilly on his broomstik.\n", "“Oh my goth!” Slugborn gosped. (geddit kos im goffik)\n", "“The Dark Lord shall kill all of you. Then you must submit to him!!!!” Snape ejaculated menacingly.\n", "“You fucking preppy fags!” Serious shouted angrily.\n", "“I know a four-letter word 4 dirt, CRUCIATUS!!!” screamed Harry but da sparks from his wand only hit Draco’s car. It fell down Snap quickly crowled out of it and picked up the cideo camera.\n", "“Oh my fucking god!!!1” I cried becoze the video of me in da bathrum, the video of me dong it wif Drako and the video of Satan doing it with\n", "“If you kill me then deze cideos will be shown to everyone in the skull. Then u can be just like that goffik girl Paris Hillton.” He laughed meanly.\n", "“No!” I scremed. “FYI I hav da picter of u doing it with Loopin!!!!11”\n", "“Whats she talking abott??????” Lupin slurped as he sat in chains.\n", "“I saw 2 she’s gunna show evry1 da picter!!!111” Harry shouted angrily.\n", "“Shut up!!!111’” Lumpkin roared.\n", "“Foolish ignoramuses!!!!!!” yielded Voldemort from his broomstick. “Thou shall all dye soon.”\n", "“Think again you fucking muggle poser!!!!!1” Harry yelled and then he and Diablo and Navel both took out blak guns! But Voldimort took out his own one.\n", "“U guyz are in a Latin stand-of!!!!!!!111” I shouted despariedrly.\n", "“Acco Nevel’s wand!!!11” cried Voldrimort nd suddenly Nevil’s wind was in his hands. “Now I shall kill thee all and Evony u will die!!!!!!!!11111”\n", "He maid lighting come all over da place.\n", "“Save us Ebony!” Dumbledark cried.\n", "I cried sexily I just wanted 2 go 2 the commen room and slit my wrists with mi friends while we watched Shark Attak 3 and Saw 2 and do it with Draco but I knew I had 2 do somefing more impotent.\n", "“ABRA KEDABRA!!!!!!!!!!!11111” I shooted."]